[
{"pk": 1, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A blend of acquired and hired.", "word": "Acqui-hire", "clue": "Can't find the staff these days?  Not to worry. Just buy out the whole team"}},
{"pk": 2, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "an acquisition or merger in which the companies involved have trouble integrating with one another.", "word": "Acquisition Indigestion", "clue": "Trouble two companies have with integrating, after an acquisition or merger"}},
{"pk": 3, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "After Work Call", "word": "AWC", "clue": "That call you get after work…often after falling asleep"}},
{"pk": 4, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A type of organization that operates in opposite fashion to a bureaucracy.", "word": "Adhocracy", "clue": "Where once there was bureaucracy, here lies the solution to endless red tape"}},
{"pk": 5, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "electronic messages from a company's executives that are of little value to the employee who has received it", "word": "Adminispam", "clue": "Yet another inbox clogging email that no one reads but is afraid to delete as it may be important later on.  Number one cause of 'inbox over the limit' messages"}},
{"pk": 6, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "the levels of management where big, impractical, and counterproductive decisions are made", "word": "Adminisphere", "clue": "That particular level of management who spend so long working out the answer, no one can even remember the question"}},
{"pk": 7, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A social condition arising from the desire to be more wealthy, successful or to \"keep up with the Joneses\".", "word": "Affluenza", "clue": "Incurable desire to 'keep up with the Joneses' through more wealth and success"}},
{"pk": 8, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Someone who makes lots of noise, disrupts everything, has the potential to make a big mess - but ultimately does nothing.", "word": "Airball", "clue": "You all know the guy.  So much talk, so little action"}},
{"pk": 9, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "someone who utilizes gifts and flattery as means of attempting to achieve promotion or favor.", "word": "Apple Polishers", "clue": "Ohh, your hair is looking fabulous today.  Did you get it cut?  Now about that promotion..."}},
{"pk": 10, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "All talk, no action. Four-letter acronym describing a person who makes promises with great fanfare, but seldom follows through", "word": "ATNA", "clue": "All talk, no action.  The quickest way to describe the guy who promises the world, then delivers nothing"}},
{"pk": 11, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The negative effect felt by a company when shareholders and the investment community find out that is has done something that is not in accordance with good business practices.", "word": "Badwill", "clue": "What happens when you misbehave. The negative effect felt by a company when its investment community find out about its poor business practices"}},
{"pk": 12, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A difficult situation that a company or individual experiences that will result in either success or failure.", "word": "Baptism of Fire", "clue": "A hard, make-or-break situation for a company or individual"}},
{"pk": 13, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Solving a difficult problem by pulling staff and resources from the four corners of the company to develop a solution.", "word": "Barn Raising ", "clue": "Solving a difficult problem by pulling staff and resources out of the woodwork to develop a solution"}},
{"pk": 14, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Old style managers that see things as right or wrong, leaving no room for discussion", "word": "Bi-tonal", "clue": "The kind of boss who sees it as black or white, with nothing inbetween"}},
{"pk": 15, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "To deflect responsibility by pointing the finer at someone else.", "word": "Blame Shift", "clue": "Seek our the weakest and most vulnerable employee and place the blame at their feet.  After all, it's your mortage/ income/ life at stake"}},
{"pk": 16, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A group process where participants analyze a failed project and look for scapegoats other than themselves", "word": "Blamestorming", "clue": "The group process of blaming everyone and everything.  Apart from yourself"}},
{"pk": 17, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The mass nod of agreement by participants in a meeting to comments made by the boss even though most have no idea what he just said ", "word": "Bobbleheading", "clue": "A boardroom full of nodding colleagues, daydreaming about what to have for lunch, who don't have a clue what's being said"}},
{"pk": 18, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "An acronym muttered by the people who do the real work when senior managers announce their latest and greatest sales/customer service/quality initiative", "word": "BOHICA", "clue": "Often heard being muttered by the people who do the real work, when senior management announce the latest round of performance/sales/customer initiatives"}},
{"pk": 19, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "An employee who leaves and comes back in the future.", "word": "Bomerang", "clue": "An employee who leaves and comes back in the future"}},
{"pk": 20, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A meeting scheduled during lunch house in which the employee not only has to work but must bring his or her own lunch", "word": "Brown Bag Session", "clue": "Not only a meeting scheduled during your lunch hour, but one in which you must bring your own lunch "}},
{"pk": 21, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Bring Your Own Advil. Description for a task that's sure to give you a headache.", "word": "BYOA", "clue": "Bring Your Own Aspirin. For this project, you're going to need it..."}},
{"pk": 22, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "CEO-speak for replacing a fellow chief executive", "word": "C-change", "clue": "Swapping one big cheese for another"}},
{"pk": 23, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The process of a company repeatedly reducing head count, but not the work, until it goes under.", "word": "Capsizing", "clue": "Repeatedly reducing head count, but not the work, until the business eventually goes under"}},
{"pk": 24, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A seasoned, outside salesperson, who has traveled extensively, been responsible for meeting a large quota and has the ulcers to prove it.", "word": "Carried a Bag", "clue": "A hardcore salesman who has more than earned his airmiles"}},
{"pk": 25, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The act of Ccing an e-mail message to anyone even remotely involved in a decision or action in order to cover your own butt.", "word": "CCYA", "clue": "The act of copying the whole world and his dog into an email to cover your own butt"}},
{"pk": 26, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "What a company's management does when it decides to trim small, trivial costs instead of cutting larger, more serious costs. ", "word": "Chasing Nickels Around Dollar Bills", "clue": "Cutting small, trivial costs; instead of bigger, serious ones"}},
{"pk": 27, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The ethical barrier between different divisions of a financial (or other) institution to avoid conflict of interest.", "word": "Chinese Wall", "clue": "Information barrier that keeps investors' actions secret from others in their company, to avoid conflict of interest"}},
{"pk": 28, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A term used to describe what a company does just before it goes down the tubes.", "word": "Circling the Drain", "clue": "Last ditch attempt at swimming, even when you know you're aboard a sinking ship"}},
{"pk": 29, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "An employee with low ambition and, consequently, low productivity.", "word": "Coaster", "clue": "Someone whose low ambition makes for low productivity"}},
{"pk": 30, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A market theory that suggests that when a company reveals bad news to the public, there may be many more related negative events that have yet to be revealed.", "word": "Cockroach Theory", "clue": "The theory that behind every bit of bad news, there's much more to be revealed.  As a wise man once said, \"There's never just one.\" "}},
{"pk": 31, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Description of someone whose sole motivation is money.", "word": "Coin Operated", "clue": "Only springs into life when money's involved"}},
{"pk": 32, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The degree of dullness of a meeting, presentation or reading material", "word": "Coma Factor", "clue": "Degree of dullness. Applies to meetings, presentations, literature - potentially some colleagues..."}},
{"pk": 33, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "An opinion or position no one really loves, but everyone is able to live with.", "word": "Consensus", "clue": "The position that noone really loves, but everyone can live with"}},
{"pk": 34, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "An organization's strategic plan that's displayed prominently behind an executive's desk, but sits untouched until it's updated the following year.", "word": "Credenza-Ware", "clue": "A company strategy that's prepared lovingly, displayed proudly on the walls - then never touched again. Until of course it's updated, the following year. See also 'Wallpaper'"}},
{"pk": 35, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A project-management technique that lays out all the activities needed to complete a task, the time it will take to complete each activity and the relationships between the activities.", "word": "Critical Path Analysis", "clue": "A fancy project management term for working out where we need to get to, and how we're going to get there"}},
{"pk": 36, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Picking from each department to create the perfect team", "word": "Crossfunctional", "clue": "6 people from different disciplines in one room…often no by choice"}},
{"pk": 37, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The collective effort of individuals who network and pool their resources to support efforts initiated by other people or organizations.", "word": "Crowdfunding", "clue": "The team effort by lots of individuals to support a person or company's initiative; by pooling thoughts and resources"}},
{"pk": 38, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "rest, relax and mentally recharge", "word": "Defrag", "clue": "Stop working, chill, recharge your brain"}},
{"pk": 39, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "To tone down or take a step back", "word": "Dial it Back", "clue": "To take a step back"}},
{"pk": 40, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The coded language spoken by diplomats to \"send a message\"   without actually committing to anything", "word": "Diplo-speak", "clue": "Abbreviation of Diplomat-Speak: the langauge that can be spoken, without saying anything at all"}},
{"pk": 41, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A receptionist. Once the punch line of an Internet joke, it's now an actual job title at some companies.", "word": "Director of First Impressions", "clue": "Receptionist. Once the the punchline of a joke - now an actual job title! Who's laughing now? We're not sure, either"}},
{"pk": 42, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Disemvowelling", "clue": "That thing you do when you want to write something rude like £%@*@ in an email without alerting IT. Yup, we're onto you"}},
{"pk": 43, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Refers to a person or group holding an unquestioned belief, argument, or philosophy without critical examination.", "word": "Drinking the Kool-Aid", "clue": "Blind obedience and absolute faith in the latest business doctrine"}},
{"pk": 44, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A person on a company's board of directors who votes and acts on the wishes of a non-board member.", "word": "Dummy Director", "clue": "A board member who acts on the wishes of someone outside of the top team - like a total dummy"}},
{"pk": 45, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A brief speech that outlines an idea for a product, service or project.", "word": "Elevator Pitch", "clue": "Brief speech outlining a product, service or idea - the way you would if you had just 60 seconds. In, say, an elevator..."}},
{"pk": 46, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "The act of attempting to increase the size and scope of an individual or organization's power and influence.", "word": "Empire Building", "clue": "Trying to widen the scope of power and influence - of either an individual, or a company"}},
{"pk": 47, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "An organization's reputation as an employer", "word": "Employer Brand", "clue": "An organization's reputation as an employer"}},
{"pk": 48, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Empower-ised", "clue": "A polite way of giving an employee more responsibility with zero pay rise"}},
{"pk": 49, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Someone who is high up in a company due to unfair hiring practices, such as nepotism, and doesn't really do anything for the company.", "word": "Empty Suit", "clue": "Wishful term for the guy who does nothing much - but gets high up in the company, through unfair hiring"}},
{"pk": 50, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A baseball reference applied to businesses that train employees only to have them leave for competing firms.", "word": "Farm Team", "clue": "A business that trains great employees - before they leave and join competing firms. Originally a baseball term"}},
{"pk": 51, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A word used to describe executives who earn what many believe to be unreasonably high salaries and bonuses. ", "word": "Fat Cat", "clue": "The executive with a ridiculously high salary or bonus - who generally gets more of the cream than they should"}},
{"pk": 52, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Term used to describe the practice of a labor union requiring an employer to hire more workers than necessary for a particular task.", "word": "Featherbedding", "clue": "Hiring someone unnecessarily - whose role it is to hire people unnecessairly - for one overstaffed project"}},
{"pk": 53, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Doing the work of employees who have been fired or laid off.", "word": "Ghost Work ", "clue": "Doing the work of employees who have been fired or laid off"}},
{"pk": 54, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A collection of financial incentives that are intended to encourage employees to remain with a company.", "word": "Golden Handcuffs", "clue": "A set of financial perks intended to retain employees"}},
{"pk": 55, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A signing bonus offered to a candidate from a rival company.", "word": "Golden Hello", "clue": "Reserved for a job candidate from a rival company, this is a special way of saying 'hi': with a huge signing bonus"}},
{"pk": 56, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "An exceptional compensation package offered by the acquiring company to the top executives of the company being bought.", "word": "Golden Life Jacket", "clue": "Handier than it sounds: a financial package offered by an acquiring company, to the top team of the company they acquire"}},
{"pk": 57, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "People who cycle to work", "word": "Gutter Bunnies", "clue": "People who cycle to work. Wear a helmet please!"}},
{"pk": 58, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Infomania", "clue": "Poor concentration as a result of the 400 unopened messages in your inbox"}}, {"pk": 59, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Someone who uses minimal energy to get the task accomplished.", "word": "Minergy", "clue": "The absolute bare minimum required to get the job done"}},
{"pk": 60, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "The \"Ohno\" second", "clue": "The exact moment you realise you've made a big mistake"}},
{"pk": 61, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Someone who works at home", "word": "Open Collar Worker", "clue": "Someone who works at home"}},
{"pk": 62, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "OT Mail", "clue": "Email sent at a god forbidden hour of the night to highlight to colleagues exactly how late one is working"}},
{"pk": 63, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "To post a job and hope you have strong candidates apply.  ", "word": "Post and Pray", "clue": "To post a job and hope you have strong candidates apply"}},
{"pk": 64, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Powerpointless", "clue": "A long, detailed Powerpoint presentation with many graphs, charts and animations but no actual purpose, relevance or significance"}},
{"pk": 65, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Ringxiety", "clue": "Always thinking it's your phone that's ringing in the office. It never is"}},
{"pk": 66, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Salmon Day", "clue": "A metaphorical reference to spending the day swimming upstream only to die at the end"}},
{"pk": 67, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Seagull Manager", "clue": "A boss who flies in, makes a lot of noise, craps on everything, then leaves"}},
{"pk": 68, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "Spending time on social networks during working hours", "word": "Social Notworking", "clue": "Spending time on social networks during working hours"}},
{"pk": 69, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "the sharing of information between two (or more) people", "word": "Sync-up", "clue": "The trendy way of sharing information. Circa 2013"}},
{"pk": 70, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "A senior executive selling to the senior executives of a another customer. ", "word": "Top to Top", "clue": "A senior executive selling to the senior executives of a another customer"}},
{"pk": 71, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "When a poor performing employee leaves to work for the competition", "word": "Torpedo", "clue": "When a poor performing employee leaves to work for the competition. Boom!"}},
{"pk": 72, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Voicism", "clue": "The act of discriminating against a colleague based on the annoying sound of their voice"}},
{"pk": 73, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Wantrepreneur", "clue": "Self proclaimed entrepreneur, usually found on Linkedin, with little evidence of any business actually being done"}},
{"pk": 74, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "", "word": "Workflower", "clue": "Someone who happily blends into the background at work without anyone knowing who they are or what they actually do"}},
{"pk": 75, "model": "buzzword.Buzzword", "fields": {"genre": 1, "definition": "An employee who has few responsibilities in their personal life such as children or spouses. This allows them to work more and travel with little advance notice. ", "word": "Zero drag", "clue": "An employee who has few responsibilities in their personal life such as children or spouses. This allows them to work more and travel with little advance notice"}},
{"pk": 76, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Any advertisement or marketing message that is presented to users as useful information.", "word": "Advermation", "clue": "An advert, fused with (or disguised as) useful information"}},
{"pk": 77, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": " \"Advertising is no longer about interrupting what people are interested in, it's about being what people are interested in.\"", "word": "Advertainment", "clue": "Advertising by entertaining"}},
{"pk": 78, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A term used by market researchers for the \"coolest kid in the neighborhood.\"", "word": "Alpha Pup", "clue": "Coolest kid in town': rare species sought widely by market researchers"}},
{"pk": 79, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "An organized index page that collects a website’s posts from the past.", "word": "Archives", "clue": "A neat index page that holds they key to a website's past - organising all of its historic posts, to browse through"}},
{"pk": 80, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The sale of an asset or item at a price significantly above the original purchase price due to high demand, rather than appreciation.", "word": "At A Premium", "clue": "At a sale price that's much higher than what the vendor paid originally for the item - due to high demand, not actial appreciation in value"}},
{"pk": 81, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "B2B", "clue": "From that company to another company"}},
{"pk": 82, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "B2C", "clue": "From that company to real life consumer"}},
{"pk": 83, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Ballpark Figure", "clue": "You know…a guess…that fits within a metaphorical sportsground"}},
{"pk": 84, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Using a company’s twitter handle to bash a company", "word": "Bashtag", "clue": "Using a company’s twitter handle to bash a company. #Ouch"}},
{"pk": 85, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A term used to describe customers who cost more to serve than they return in value", "word": "Below Zeros", "clue": "Customers who cost more to serve than they actually spend"}},
{"pk": 86, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "When a technology is overtaken in the market by inferior but better marketed competition.", "word": "Betamaxed", "clue": "When your awesome product gets outplayed by the marketing of an inferior one"}},
{"pk": 87, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A retail store that occupies an enormous amount of physical space and offers a variety of products to its customers.", "word": "Big Box Retailer", "clue": "AKA supercenter, superstore or super retail outlet offering absolutely everything to absolutely everyone"}},
{"pk": 88, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Branding schemes that strip out any uniqueness in a corporate identity in order to appear to a larger audience", "word": "Blanding", "clue": "Branding that takes away identity and uniqueness instead of adding to it - in an attempt to please a wider audience"}},
{"pk": 89, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Anything that’s overwritten- often padded with unnecessary adjectives or laden with hyperbole. Also appropriately known as 'BS'", "word": "Bloated Syntax", "clue": "Overwritten, padded with unnecessary syllables, adjectives and rhetoric; better known simply as 'BS'"}},
{"pk": 90, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Paying well-known bloggers to write about a product or service under the guise of newsworthy information.", "word": "Blogola", "clue": "Paying successful bloggers to write about a product or service"}},
{"pk": 91, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "the social universe created by online individuals using web log publishing platforms.", "word": "Blogosphere", "clue": "The online universe of self-publishing fanatics known as 'bloggers'"}},
{"pk": 92, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Someone who relentlessly trumptes the brand and pushes for all decisions to be aligned with the company’s \"brand essence\"", "word": "Brandroid", "clue": "The one who talks non-stop about the brand and wants everything aligned to company 'brand essence'. And we mean everything"}},
{"pk": 93, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "businesses that have physical (rather than online or virtual) presences", "word": "Brick-and-Mortar", "clue": "Present physically in the business world, instead of online"}},
{"pk": 94, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Mixing Inbound and outbound calls for call center agents to smooth out peaks and troughs of inbound calls and keep agents productive in quiet periods. ", "word": "Call Blending", "clue": "Mixing Inbound and outbound calls for call center agents to smooth out peaks and troughs of inbound calls and keep agents productive in quiet periods"}},
{"pk": 95, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A company's value based on name recognition and brand, not tangible assets. ", "word": "Capitalized Reputation", "clue": "A company's value as measured by its brand, reputation and name recognition"}},
{"pk": 96, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A seasoned, outside salesperson, who has traveled extensively, been responsible for meeting a large quota and has the ulcers to prove it.", "word": "Carried a Bag", "clue": "A hardcore salesman who has more than earned his airmiles"}},
{"pk": 97, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Large companies that put less efficient and highly specialized merchants out of business.", "word": "Category Killer", "clue": "Giant companies that put others in their category - often specialist merchants - out of business"}},
{"pk": 98, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A Latin phrase for \"let the buyer beware.\" ", "word": "Caveat Emptor", "clue": "Latin for \"let the buyer beware\""}},
{"pk": 99, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "\"CHANGES THE WORLD!\"", "clue": "\"It NOW comes in strawberry flavour!\" Oh..that's it?"}},
{"pk": 100, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A single process used across different service channels", "word": "Channel Agnostic", "clue": "One size fits all.  Right?  Use this process across different service channels"}},
{"pk": 101, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "To artificially increase revenue figures by selling to dealers and distributors who do not have ultimate buyers. ", "word": "Channel Stuffing", "clue": "Need to bump up this quarter's figures?  Do this and deal with the consequences later…"}},
{"pk": 102, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "When a new marketing channel steals business from existing channels without adding new growth.", "word": "Channibalism", "clue": "When a new marketing channel eats up all the business from existing ones - without adding new growth"}},
{"pk": 103, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A traditional company that managed to successfully integrate the Internet into its existing channels.", "word": "Clicks and Mortar", "clue": "A traditional company, with physical stores, that successfully incorporates Internet into its channels"}},
{"pk": 104, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Marketing-speak for anything that focuses on the needs of the customer.", "word": "Client-centric", "clue": "Revolving around the customer and their needs"}},
{"pk": 105, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A theory that seeks to explain the effect that 24-hour news networks, such as CNN, have on the general political and economic climate.", "word": "CNN Effect", "clue": "The general, political and economic effects experienced when 24 hour news networks cover a story"}},
{"pk": 106, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "When your competitor is also a partner or collaborator", "word": "Co-opetition", "clue": "When your competitor is also a partner or collaborator"}},
{"pk": 107, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A market theory that suggests that when a company reveals bad news to the public, there may be many more related negative events that have yet to be revealed.", "word": "Cockroach Theory", "clue": "The theory that behind every bit of bad news, there's much more to be revealed.  As a wise man once said, \"There's never just one.\" "}},
{"pk": 108, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A market that is believed to have the potential to make a strong move in one direction after being pushed in the opposite direction.", "word": "Coiled Market", "clue": "A market that is believed to have the potential to make a strong move in one direction after being pushed in the opposite direction"}},
{"pk": 109, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The solicitation of potential customers who were not anticipating such an interaction. ", "word": "Cold Calling", "clue": "Calling a potential customer or client who isn't expecting to hear from you. Expect a cold response!"}},
{"pk": 110, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A Web page that opens after you unsubscribe from an e-mail list, where a final appeal is made to keep you.", "word": "Columbo Site", "clue": "The website that opens after you unsubscribe from a mailing list as a last desperate shot at persuading you to stay"}},
{"pk": 111, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "An act of self-infringement upon market share by corporations through the issuance of new products.", "word": "Corporate Cannibalism", "clue": "A company launching products into a market they already dominate... effectively competing against themselves"}},
{"pk": 112, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "An economic condition in which investment capital is difficult to obtain. ", "word": "Credit Crunch", "clue": "The economic climate in which consumers panic and begin buying supermarket own labels 'coz it's the credit crunch, innit'"}},
{"pk": 113, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A very important or crucial stage in a company's development, where the business activity acquires self-sustaining viability. ", "word": "Critical Mass", "clue": "A really important stage in a company's development when it finally becomes able to support itself"}},
{"pk": 114, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Selling additional related products", "word": "Cross Sell", "clue": "You may already have that, but you DEFINITELY need this shiny thing as well.  It's best in class.."}},
{"pk": 115, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The collective effort of individuals who network and pool their resources to support efforts initiated by other people or organizations.", "word": "Crowdfunding", "clue": "The team effort by lots of individuals to support a person or company's initiative; by pooling thoughts and resources"}},
{"pk": 116, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A product or service that has an energetic and loyal customer base.", "word": "Cult Brand", "clue": "Most brands can but dream of reaching these lofty heights"}},
{"pk": 117, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": " Sum of all experiences a customer has with a supplier of goods and services, over the duration of their relationship with that supplier. From awareness, discovery, attraction, interaction, purchase, use, cultivation and advocacy. It can also be used to mean an individual experience over one transaction; the distinction is usually clear in context.", "word": "Customer Experience", "clue": "Sum of all experiences a customer has with a supplier of goods and services, over the duration of their relationship with that supplier"}},
{"pk": 118, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The failure of a company or industry to accept that the Internet has changed the world and made their business model obsolete", "word": "Digital Denial", "clue": "Belligerent denial that the Internet has changed the world and refusal to adapt or accept change"}},
{"pk": 119, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Digital Native", "clue": "Smartphone - check! 19 social media accounts - check! Multi-platform multitasking app loving person - check!"}},
{"pk": 120, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A marketing and sales strategy retailers use to get a high volume of customers into their stores.", "word": "Doorbuster", "clue": "The practise of offering too-good-to-be-true prices to customers to get them through the door"}},
{"pk": 121, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": " Sending several marketing communications over a period of time to a subset of contacts", "word": "Drip-Marketing", "clue": " Sending several marketing communications over a period of time to a subset of contacts"}},
{"pk": 122, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Dynamic content is content that is constantly changing.", "word": "Dynamic Content ", "clue": "Content that's constantly evolving"}},
{"pk": 123, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The sale of goods and services through the Internet.", "word": "E-Tailing", "clue": "Selling online"}},
{"pk": 124, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Using a product yourself which you sell to others", "word": "Eating Your Own Dogfood", "clue": "Using the product you're selling to others"}},
{"pk": 125, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A type of business model, or segment of a larger business model, that enables a firm or individual to conduct business over an electronic network, typically the internet.", "word": "Ecommerce", "clue": "A type of business model, or segment of one, that lets a company do business over networks like the internet"}},
{"pk": 126, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A brief speech that outlines an idea for a product, service or project.", "word": "Elevator Pitch", "clue": "Brief speech outlining a product, service or idea - the way you would if you had just 60 seconds. In, say, an elevator..."}},
{"pk": 127, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "An organization's reputation as an employer", "word": "Employer Brand", "clue": "An organization's reputation as an employer"}},
{"pk": 128, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "the use of emergent social software platforms within companies, or between companies and their partners or customers", "word": "Enterprise 2.0", "clue": "The use of social media in business: both b2b, and b2c. We like it"}},
{"pk": 129, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The raw number of people that look at a website", "word": "Eyeballs", "clue": "People - when talking about the raw number of them that look at a website"}},
{"pk": 130, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Selling goods or assets at heavily discounted prices.", "word": "Fire Sale", "clue": "Urgently selling goods at heavily discounted prices"}},
{"pk": 131, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "An accounting buzzword that describe when companies still have inventory on hand that is not being sold due to inattention or obsolescence.", "word": "First In, Still Here - FISH", "clue": "When companies still have inventory that's not being sold"}},
{"pk": 132, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A form of competitive advantage that a company earns by being the first to enter a specific market or industry.", "word": "First Mover", "clue": "A company earns this competitive adventage by being the first to enter a specific market or industry"}},
{"pk": 133, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Flashmob", "clue": "That over used idea of a bunch of people showing up at one place at one time…and doing something goofy"}},
{"pk": 134, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": " A business model where the basic offer is free, but charges a premium for additional  features or services.", "word": "Freemium", "clue": "It costs nothing, really. Oh, but you can't get the good stuff without opening your wallet"}},
{"pk": 135, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Requesting someone to be a friend and or buddy on an online social network. Reference to World of Warcraft game", "word": "Friendquest", "clue": "A new red notification on facebook.  Your social network just got a little bit bigger…"}},
{"pk": 136, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A company that alters its business strategy and conceives an entirely new business plan.", "word": "Game Changer", "clue": "A company that alters its business strategy and in doing so, conceives an entirely new business plan"}},
{"pk": 137, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "content that provides a game-like experience, usually through an entertainment and reward system.", "word": "Gamification", "clue": "Turning content into a game-like experience, through entertainment and rewards"}},
{"pk": 138, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": " To display a company's ad when a person visits a rival company's Web site.", "word": "Gator", "clue": "To display a company's ad when a person visits a rival company's Web site"}},
{"pk": 139, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The practice of raising the price of a previously agreed-upon real estate transaction.", "word": "Gazump", "clue": "A cheeky practice originating from dodgy car salesmen who raised the price after a transaction had already been agreed"}},
{"pk": 140, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Generation Y", "clue": "That awesome millenial force of socially connected and tech savvy people"}},
{"pk": 141, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A product or service that is developed and distributed globally, but is also fashioned to accommodate the user or consumer in a local market. ", "word": "Glocalization", "clue": "Imagine a McDonald's Big Mac with the flavours of Mumbai"}},
{"pk": 142, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A source of lots of money, such as shoppers who are expected to spend a lot or high-income earners who are expected to pay a lot in taxes.", "word": "Golden Geese", "clue": "Close cousin of the cash cow, these shoppers sure know how to spend spend spend!"}},
{"pk": 143, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Greenwashing", "clue": "Your so \"eco\" & in love with the Earth that no one believes you"}},
{"pk": 144, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A role that replaces traditional marketing roles in fast-growing businesses.", "word": "Growth Hacker", "clue": "A marketing role for trendy technie types.  Circa 2013"}},
{"pk": 145, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "the descriptive words that describe a piece of media. ", "word": "Keywords", "clue": "Words that best describe a piece of media - often used to identify it in an internet or database search"}},
{"pk": 146, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The value of the customer to a business over the lifetime of that customers interactions with the business ", "word": "Lifetime Value (LTV)", "clue": "The value of the customer to a business over a all future interactions. Calculated by…well I don't know actually"}},
{"pk": 147, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Easy business to close", "word": "Low-Hanging Fruit", "clue": "Easy business to close"}},
{"pk": 148, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "an idea, behavior, or style that spreads from person to person within a culture.", "word": "Meme", "clue": "One idea, theme, behaviour or style that spreads from person to person; getting copied with lots of individual twists. Now, do the Harlem Shake..."}},
{"pk": 149, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "short blog posts (twitter)", "word": "Microblogging", "clue": "The art of teensy blog posts with a character limit - think Twitter"}},
{"pk": 150, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A company's ability to retain a piece of the publics consciousness", "word": "Mindshare", "clue": "Amount of space your company takes up in the public's thoughts - like cerebral real estate!"}},
{"pk": 151, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A form or marketing where the product or service is not mentioned or shown.  Combination of Murky and Marketing", "word": "Murketing", "clue": "A form or marketing where the product or service is not mentioned or shown.  Combination of Murky and Marketing"}},
{"pk": 152, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "A form of marketing where the marketer asks the consumer for permission to send them targeted ads based on personal data supplied by the consumer.", "word": "Permission Marketing", "clue": "You're going to need permission before doing any of this…"}},
{"pk": 153, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "an audio program in a compressed digital format, which is deigned to be listened to over the web.", "word": "Podcast", "clue": "Audio program, compressed digitally to be heard or downloaded over the web"}},
{"pk": 154, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Powerpointless", "clue": "A long, detailed Powerpoint presentation with many graphs, charts and animations but no actual purpose, relevance or significance"}},
{"pk": 155, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Pay Per Click – Advertisers only pay when a prospect “clicks through” to their site. Theydo not  pay for their ad placement.", "word": "PPC", "clue": "No fee for posting these ads.  But things could get expensive if lots of traffic comes through them…"}},
{"pk": 156, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Push Poll", "clue": "An opinion poll that's there to sway opinions, not measure them"}},
{"pk": 157, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "The bad mood of sales managers towards the end of a quarter.", "word": "Quarterly Charm Deficiency", "clue": "The bad mood of sales managers towards the end of a quarter"}},
{"pk": 158, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "an acronym for Really Simple Syndication. This XML based format has become the preferred standard for syndicating content across the web.", "word": "RSS", "clue": "Rich Site Summary - later dubbed Really Simple Syndication - this style of web feed is the preferred way to send out lots of regular updates: blogs and news feeds, for example"}},
{"pk": 159, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "when a reps reports a lower number for an opportunity than it is in reality so that if the deal does not close. IT does not reflect as badly on the rep at quarter end the rep is not pressured to close the bigger deal so that sales can make their target.   ", "word": "Sandbagging", "clue": "Underestimating the value of a potential deal to mitigate against high blood pressure at the end of the sales quarter, when hitting those targets is top of the agenda!"}},
{"pk": 160, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "– Search engine optimisation ", "word": "SEO", "clue": "Helps to get you just that little bit higher up the google search"}},
{"pk": 161, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "If your forcast done in your spreadsheet  does not match with the forecast done in your CRM system.", "word": "Sheetzophrenic", "clue": "If your forcast done in your spreadsheet  does not match with the forecast done in your CRM system. Oops"}},
{"pk": 162, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Short Attention Spam", "clue": "A well honed ability to detect and delete spam without even opening the email"}},
{"pk": 163, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "when an online store treats brick and mortar stores as their showroom. ", "word": "Showrooming", "clue": "When an online retailer uses physical stores as their showroom: knowing that customers will buy online after they've looked at the product in-store"}},
{"pk": 164, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "a diagram of the interconnections between people, with the people serving as nodes, and the lines between them showing the connections. ", "word": "Social Graph", "clue": "A diagram of the social connections between people: looks like what would happen if your social network was a giant, tangled constellation"}},
{"pk": 165, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Generating publicity through social media to increase awareness of a product, brand or event", "word": "Social media optimization (SMO) ", "clue": "Making the most of Facebook, Twitter, Pinterest, Instagram to promote a brand or product"}}, {"pk": 166, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Spending time on social networks during working hours", "word": "Social Notworking", "clue": "Spending time on social networks during working hours"}},
{"pk": 167, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "SoLoMo", "clue": "Stuff that works at a local level, on a mobile, in a social way. Sounds like a cocktail"}},
{"pk": 168, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "anything about a website or content that encourages a visitor to linger longer.", "word": "Stickiness", "clue": "Anything that encourages website visitors to stay a little bit longer"}},
{"pk": 169, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Twintership", "clue": "An internship offered by digitally backward companies to recent graduates.  \"Do that Twitter thing for us, yeah?\""}},
{"pk": 170, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "UGC", "clue": "When normal people create the content for you"}},
{"pk": 171, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": " Increasing a sale amount by positioning a higher value item.", "word": "Upsell", "clue": " Increasing a sale amount by positioning a higher value item"}},
{"pk": 172, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "Unique Selling Point – your differentiator", "word": "USP", "clue": "That one thing that makes what you sell supposedly unique"}},
{"pk": 173, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Vanillacide", "clue": "Making hundreds of nice little changes to an idea - until it dies of mediocrity"}},
{"pk": 174, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "", "word": "Viral", "clue": "That supposed nirvana where an idea gets passed around exponentially with little (visible) promotion"}},
{"pk": 175, "model": "buzzword.Buzzword", "fields": {"genre": 2, "definition": "web sites that use technology beyond the static pages of earlier web sites.", "word": "Web 2.0", "clue": "Static, vintage pages from the dark age of web tech: powered by newer technology beyond them"}}, 
{"pk": 176, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "After Work Call", "word": "AWC", "clue": "That call you get after work…often after falling asleep"}}, {"pk": 177, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "Average Handling Time", "word": "AHT", "clue": "The time on average…that it takes to handle…that average customer."}}, 
{"pk": 178, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "", "word": "B2B", "clue": "From that company to another company"}}, {"pk": 179, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "", "word": "B2C", "clue": "From that company to real life consumer"}}, {"pk": 180, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "A term used to describe customers who cost more to serve than they return in value", "word": "Below Zeros", "clue": "Customers who cost more to serve than they actually spend."}}, {"pk": 181, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "A retail store that occupies an enormous amount of physical space and offers a variety of products to its customers.", "word": "Big Box Retailer", "clue": "AKA supercenter, superstore or super retail outlet offering absolutely everything to absolutely everyone."}}, {"pk": 182, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "businesses that have physical (rather than online or virtual) presences", "word": "Brick-and-mortar", "clue": "Present physically in the business world, instead of online. "}}, {"pk": 183, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "Mixing Inbound and outbound calls for call center agents to smooth out peaks and troughs of inbound calls and keep agents productive in quiet periods. ", "word": "Call Blending", "clue": "Mixing Inbound and outbound calls for call center agents to smooth out peaks and troughs of inbound calls and keep agents productive in quiet periods."}}, {"pk": 184, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "A single process used across different service channels", "word": "Channel Agnostic", "clue": "A single process used across different service channels"}}, {"pk": 185, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "Marketing-speak for anything that focuses on the needs of the customer.", "word": "Client-centric", "clue": "Revolving around the customer and their needs."}}, {"pk": 186, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "When your competitor is also a partner or collaborator.", "word": "Co-opetition", "clue": "When your competitor is also a partner or collaborator. Is this awkward?"}}, {"pk": 187, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "The solicitation of potential customers who were not anticipating such an interaction. ", "word": "Cold Calling", "clue": "Calling a potential customer or client who isn't expecting to hear from you. Expect a cold response!"}}, {"pk": 188, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "The amount of effort a customer expend to get their problems solved", "word": "Customer Effort", "clue": "The amount of effort a customer expend to get their problems solved. In other words: A LOT"}}, {"pk": 189, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": " Sum of all experiences a customer has with a supplier of goods and services, over the duration of their relationship with that supplier. From awareness, discovery, attraction, interaction, purchase, use, cultivation and advocacy. It can also be used to mean an individual experience over one transaction; the distinction is usually clear in context.", "word": "Customer Experience", "clue": "The nebulous journey of someone trying to engage with your business"}}, {"pk": 190, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "A marketing and sales strategy retailers use to get a high volume of customers into their stores.", "word": "Doorbuster", "clue": "The practise of offering too-good-to-be-true prices to customers to get them through the door"}}, {"pk": 191, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "The sale of goods and services through the Internet.", "word": "E-Tailing", "clue": "Selling online"}}, {"pk": 192, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "Using a product yourself which you sell to others", "word": "Eating Your Own Dogfood", "clue": "Using the product you're selling to others"}}, {"pk": 193, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "Method Used to determine the number of lines required to handle a known calling load in an hour ", "word": "Erlang A", "clue": "Method Used to determine the number of lines required to handle a known calling load in an hour. Sounds a bit silly"}}, {"pk": 194, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "Used to calculate waiting times, based on the number of call center agents available, the number of callers and the average time it takes to handle a call.", "word": "Erlang B", "clue": "Used to calculate waiting times. Wish it calculated better music while I am on hold"}}, {"pk": 195, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "First Contact Resolution", "word": "FCR", "clue": "1st Contact Resolution. Boom. Onto the next one"}}, {"pk": 196, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "The value of the customer to a business over the lifetime of that customers interactions with the business ", "word": "Lifetime Value (LTV)", "clue": "The value of the customer to a business over a all future interactions. Calculated by…well I don't know actually"}}, {"pk": 197, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "Resolving a customer issue in one call ( see FCR below)", "word": "One and Done", "clue": "What you need to call back? Seriously? I touch things once"}}, {"pk": 198, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": "when an online store treats brick and mortar stores as their showroom. ", "word": "Showrooming", "clue": "When an online retailer uses physical stores as their showroom: knowing that customers will buy online after they've looked at the product in-store"}}, {"pk": 199, "model": "buzzword.Buzzword", "fields": {"genre": 3, "definition": " Increasing a sale amount by positioning a higher value item.", "word": "Upsell", "clue": "Increasing a sale amount by positioning a higher value item. Bait and switch?"}}, {"pk": 200, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Big Data", "clue": "That amorphous idea of tons of bits of information. Could be insightful in the right hands"}}, {"pk": 201, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "Technology that is acquired almost immediately after its release, regardless of the increased cost or risk involved", "word": "Bleeding Edge Technology", "clue": "Technology acquired as soon as it's released - regardless of gory risks or cost increases for the buyers"}}, {"pk": 202, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "Large companies that put less efficient and highly specialized merchants out of business.", "word": "Category Killer", "clue": "Giant companies that put others in their category, often specialist merchants, out of business"}}, {"pk": 203, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "When your competitor is also a partner or collaborator", "word": "Co-opetition", "clue": "When your competitor is also a partner or collaborator"}}, {"pk": 204, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "Corporate initiative to assess and take responsibility for the company's effects on the environment and impact on social welfare.", "word": "Corporate Social Responsibilty - CSR", "clue": "The measures a company takes to have a positive impact on the world"}}, {"pk": 205, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "The collective effort of individuals who network and pool their resources to support efforts initiated by other people or organizations.", "word": "Crowdfunding", "clue": "The team effort by lots of individuals to support a person or company's initiative; by pooling thoughts and resources"}}, {"pk": 206, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "Death by Tweakage. When a product or project fails due to unnecessary tinkering or too many last-minute revisions.", "word": "DBT", "clue": "Death by Tweakage.  A project ruined by too many cooks spoiling the broth"}}, {"pk": 207, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "A failure that occurs as a result of many smaller problems.", "word": "Death By A Thousand Cuts", "clue": "A failure resulting from the combination of many smaller problems"}}, {"pk": 208, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "The failure of a company or industry to accept that the Internet has changed the world and made their business model obsolete", "word": "Digital Denial", "clue": "Belligerent denial that the Internet has changed the world and refusal to adapt or accept change"}}, {"pk": 209, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "To remove ambiguities. To make clear. Used extensively by software developers", "word": "Disambiguate", "clue": "A not very clear word to make things clear"}}, {"pk": 210, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "A company that embraces the internet as the key component in its business. ", "word": "Dotcom", "clue": "The 1990s movement that pioneered the digital revolution"}}, {"pk": 211, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "the use of emergent social software platforms within companies, or between companies and their partners or customers", "word": "Enterprise 2.0", "clue": "The use of social media in business: both b2b, and b2c. We like it"}}, {"pk": 212, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "An accounting buzzword that describe when companies still have inventory on hand that is not being sold due to inattention or obsolescence.", "word": "First In, Still Here - FISH", "clue": "When companies still have inventory that's not being sold"}}, {"pk": 213, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "A form of competitive advantage that a company earns by being the first to enter a specific market or industry.", "word": "First Mover", "clue": "A company earns this competitive adventage by being the first to enter a specific market or industry"}}, {"pk": 214, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": " A business model where the basic offer is free, but charges a premium for additional  features or services.", "word": "Freemium", "clue": "It costs nothing, really. Oh, but you can't get the good stuff without opening your wallet"}}, {"pk": 215, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "A company that alters its business strategy and conceives an entirely new business plan.", "word": "Game Changer", "clue": "A company that alters its business strategy and in doing so, conceives an entirely new business plan"}}, {"pk": 216, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "content that provides a game-like experience, usually through an entertainment and reward system.", "word": "Gamification", "clue": "Turning content into a game-like experience, through entertainment and rewards"}}, {"pk": 217, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Generation Y", "clue": "That awesome millenial force of socially connected and tech savvy people"}}, {"pk": 218, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "Technology that is considered environmentally friendly based on its production process or supply chain.", "word": "Green Tech", "clue": "Technology that's environmentally friendly from the word go - all the way through its supply chain and production process"}}, {"pk": 219, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "A role that replaces traditional marketing roles in fast-growing businesses.", "word": "Growth Hacker", "clue": "A marketing role for trendy technie types.  Circa 2013"}}, {"pk": 220, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Hack-a-Thon", "clue": "Get the dev team to drink tons of caffeine and invent stuff until the sun rises"}}, {"pk": 221, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "a software bug that seems to disappear or alter its behavior when one attempts to study it.", "word": "Heisenbug", "clue": "More erratic than its quantum physics namesake, this shifty software bug seems to vanish or change when you try to study it"}}, {"pk": 222, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Hockey Stick", "clue": "The mythical revenue chart that shows your idea going like a rocket…just not now"}}, {"pk": 223, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "a cloud computing environment in which an organization provides and manages some resources in-house and has others provided externally.", "word": "Hybrid Cloud", "clue": "In-house and external resources being fused in a company's cloud computing environment"}}, {"pk": 224, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "This is a software program that lets users map data from one application to another.", "word": "Integration Connector", "clue": "Tech speak for software that lets applications share data"}}, {"pk": 225, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "The \"Ohno\" second", "clue": "The exact moment you realise you've made a big mistake"}}, {"pk": 226, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Omni-Shambles", "clue": "Badly organised and ineffective in every single way"}}, {"pk": 227, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "an essential shift from way one of thinking to another", "word": "Paradigm Shift", "clue": "Sadly not an office disco dance move - yet. This term describes a shift from one way of thinking to another"}}, {"pk": 228, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "A mixture of a smartphone and tablet.", "word": "Phablets", "clue": "What happened after a tequila fuelled night of passion between a smartphone and a tablet..."}}, {"pk": 229, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "Used for companies when they're 'changing direction' rather than indicating a mistake or something similarly negative.", "word": "Pivot", "clue": "A positive spin tech companies use to indicate 'changing direction'.  Not that they got it wrong.  Honest"}}, {"pk": 230, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Powerpointless", "clue": "A long, detailed Powerpoint presentation with many graphs, charts and animations but no actual purpose, relevance or significance"}}, {"pk": 231, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "this is a marketing term for a proprietary computing architecture that provides hosted services to a limited number of people behind a firewall.", "word": "Private Cloud", "clue": "Marketing-speak for privately-hosted services, to a set number of people behind a firewall"}}, {"pk": 232, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "A public cloud is one based on the standard cloud computing model, in which a service provider makes resources, such as applications and storage, available to the general public over the Internet", "word": "Public Cloud", "clue": "Applications, storage and other resources made available to the public through the Internet"}}, {"pk": 233, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Salmon Day", "clue": "A metaphorical reference to spending the day swimming upstream only to die at the end"}}, {"pk": 234, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "If your forcast done in your spreadsheet  does not match with the forecast done in your CRM system.", "word": "Sheetzophrenic", "clue": "If your forcast done in your spreadsheet  does not match with the forecast done in your CRM system. Oops"}}, {"pk": 235, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "when an online store treats brick and mortar stores as their showroom. ", "word": "Showrooming", "clue": "When an online retailer uses physical stores as their showroom: knowing that customers will buy online after they've looked at the product in-store"}}, {"pk": 236, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "SoLoMo", "clue": "Stuff that works at a local level, on a mobile, in a social way. Sounds like a cocktail"}}, {"pk": 237, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "anything about a website or content that encourages a visitor to linger longer.", "word": "Stickiness", "clue": "Anything that encourages website visitors to stay a little bit longer"}}, {"pk": 238, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Twintership", "clue": "An internship offered by digitally backward companies to recent graduates.  \"Do that Twitter thing for us, yeah?\""}}, {"pk": 239, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "Unique Selling Point – your differentiator", "word": "USP", "clue": "That one thing that makes what you sell supposedly unique"}}, {"pk": 240, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Vanillacide", "clue": "Making hundreds of nice little changes to an idea - until it dies of mediocrity"}}, {"pk": 241, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Wantrepreneur", "clue": "Self proclaimed entrepreneur, usually found on Linkedin, with little evidence of any business actually being done"}}, {"pk": 242, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "web sites that use technology beyond the static pages of earlier web sites.", "word": "Web 2.0", "clue": "Static, vintage pages from the dark age of web tech: powered by newer technology beyond them"}}, {"pk": 243, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "", "word": "Whiteboard Waffle", "clue": "Where the genius of your idea only works when written with dry erase markers"}}, {"pk": 244, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "Using mobile devices and wireless technology to work anywhere", "word": "Workshifting", "clue": "Using mobile devices and wireless technology to work anywhere"}}, {"pk": 245, "model": "buzzword.Buzzword", "fields": {"genre": 4, "definition": "One yottabyte (abbreviated \"YB\") is equal to 1,000 zettabytes and is the largest SI unit of measurement used for measuring data.", "word": "Yottabyte", "clue": "Techie speak for a WHOLE lorry load of data"}}, {"pk": 246, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A significant amount of money", "word": "A Ton Of Money", "clue": "A significant sum of money. Say, a ton..."}}, {"pk": 247, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "After Work Call", "word": "AWC", "clue": "That call you get after work…often after falling asleep"}}, {"pk": 248, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Electronic messages from a company's executives that are of little value to the employee who has received it", "word": "Adminispam", "clue": "Yet another inbox clogging email that no one reads but is afraid to delete as it may be important later on. #1 cause of 'inbox over the limit' messages"}}, {"pk": 249, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "the levels of management where big, impractical, and counterproductive decisions are made", "word": "Adminisphere", "clue": "That particular level of management who spend so long working out the answer, no one can even remember the question"}}, {"pk": 250, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A social condition arising from the desire to be more wealthy, successful or to \"keep up with the Joneses\".", "word": "Affluenza", "clue": "Incurable desire to 'keep up with the Joneses' through more wealth and success"}}, {"pk": 251, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A web-based tool that collects and delivers syndicated content.", "word": "Aggregator", "clue": "Like a futuristic postman: an online tool that collects and delivers syndicated content"}}, {"pk": 252, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Someone who makes lots of noise, disrupts everything, has the potential to make a big mess - but ultimately does nothing.", "word": "Airball", "clue": "You all know the guy.  So much talk, so little action"}}, {"pk": 253, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A term used by market researchers for the \"coolest kid in the neighborhood.\"", "word": "Alpha Pup", "clue": "Coolest kid in town': rare species sought widely by market researchers"}}, {"pk": 254, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "non-scientific observations or studies, which do not provide proof but may assist research efforts", "word": "Anecdotal Evidence", "clue": "Non-scientific observations and stories, used to back up an argument"}}, {"pk": 255, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "someone who utilizes gifts and flattery as means of attempting to achieve promotion or favor.", "word": "Apple Polishers", "clue": "Ohh, your hair is looking fabulous today.  Did you get it cut?  Now about that promotion..."}}, {"pk": 256, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An organized index page that collects a website’s posts from the past.", "word": "Archives", "clue": "A neat index page that holds they key to a website's past - organising all of its historic posts, to browse through"}}, {"pk": 257, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A market theory that states stock prices and aspirin production are inversely related.", "word": "Aspirin Count Theory", "clue": "The theory that when stock prices go up, aspirin production goes down. A headache to understand..."}}, {"pk": 258, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "All talk, no action. Four-letter acronym describing a person who makes promises with great fanfare, but seldom follows through", "word": "ATNA", "clue": "All talk, no action.  The quickest way to describe the guy who promises the world, then delivers nothing"}}, {"pk": 259, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "B2B", "clue": "From that company to another company"}}, {"pk": 260, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "B2C", "clue": "From that company to a real life consumer"}}, {"pk": 261, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Any action or practice that would reflect badly on the company", "word": "Bad Cosmetics", "clue": "Actions that aren't pretty, when it comes to their effect on company reputation"}}, {"pk": 262, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The negative effect felt by a company when shareholders and the investment community find out that is has done something that is not in accordance with good business practices.", "word": "Badwill", "clue": "What happens when you misbehave. The negative effect felt by a company when its investment community find out about its poor business practices"}}, {"pk": 263, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Ballpark Figure", "clue": "You know…a guess…that fits within a metaphorical sportsground"}}, {"pk": 264, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A difficult situation that a company or individual experiences that will result in either success or failure.", "word": "Baptism of Fire", "clue": "A hard, make-or-break situation for a company or individual"}}, {"pk": 265, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Solving a difficult problem by pulling staff and resources from the four corners of the company to develop a solution.", "word": "Barn Raising ", "clue": "Solving a difficult problem by pulling staff and resources out of the woodwork to develop a solution"}}, {"pk": 266, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Using a company’s twitter handle to bash a company", "word": "Bashtag", "clue": "Using a company’s twitter handle to bash a company #Ouch"}}, {"pk": 267, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Big Damn Number", "word": "BDN", "clue": "Big Damn Number!"}}, {"pk": 268, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A term used to describe customers who cost more to serve than they return in value", "word": "Below Zeros", "clue": "Customers who cost more to serve than they actually spend"}}, {"pk": 269, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "BHAG", "clue": "A goal so big that it is awfully hairy and awfully audacious"}}, {"pk": 270, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Big Data", "clue": "That amorphous idea of tons of bits of information. Could be insightful in the right hands"}}, {"pk": 271, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Old style managers that see things as right or wrong, leaving no room for discussion", "word": "Bi-tonal", "clue": "The kind of boss who sees it as black or white, with nothing inbetween"}}, {"pk": 272, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A day of stock market catastrophe.", "word": "Black Friday", "clue": "A day of stock market catastrophe, in which prices crash"}}, {"pk": 273, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "To deflect responsibility by pointing the finer at someone else.", "word": "Blame Shift", "clue": "Seek out the weakest and most vulnerable employee and place the blame at their feet.  After all, it's your mortage/income/life at stake"}}, {"pk": 274, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A group process where participants analyze a failed project and look for scapegoats other than themselves", "word": "Blamestorming", "clue": "The group process of blaming everyone and everything.  Apart from yourself"}}, {"pk": 275, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Branding schemes that strip out any uniqueness in a corporate identity in order to appear to a larger audience", "word": "Blanding", "clue": "Branding that takes away identity and uniqueness instead of adding to it - in an attempt to please a wider audience"}}, {"pk": 276, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Technology that is acquired almost immediately after its release, regardless of the increased cost or risk involved", "word": "Bleeding Edge Technology", "clue": "Technology acquired as soon as it's released - regardless of gory risks or cost increases for the buyers"}}, {"pk": 277, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Anything that’s overwritten- often padded with unnecessary adjectives or laden with hyperbole. Also appropriately known as 'BS'", "word": "Bloated Syntax", "clue": "Overwritten with unnecessary syllables, adjectives and rhetoric; better known simply as 'BS'"}}, {"pk": 278, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "the social universe created by online individuals using web log publishing platforms.", "word": "Blogosphere", "clue": "The online universe of self-publishing fanatics known as 'bloggers'"}}, {"pk": 279, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The mass nod of agreement by participants in a meeting to comments made by the boss even though most have no idea what he just said ", "word": "Bobbleheading", "clue": "A boardroom full of nodding colleagues, daydreaming about what to have for lunch, who don't have a clue what's being said"}}, {"pk": 280, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The core teachings, skills and research in a field or industry.", "word": "Body Of Knowledge - BOK", "clue": "The fundamentals of an industry, right down to the basics"}}, {"pk": 281, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An acronym muttered by the people who do the real work when senior managers announce their latest and greatest sales/customer service/quality initiative", "word": "BOHICA", "clue": "Often heard being muttered by the people who do the real work, when senior management announce the latest round of performance/sales/customer initiatives"}}, {"pk": 282, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "To undertake an impossible task or project or to make a task or project unnecessarily difficult.", "word": "Boiling The Ocean", "clue": "Making the impossible, impossible"}}, {"pk": 283, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Quick-fix solutions or business practices that turn toxic", "word": "Botchulism", "clue": "Quick-fix solutions or business practices that turn toxic"}}, {"pk": 284, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Someone who relentlessly trumptes the brand and pushes for all decisions to be aligned with the company’s \"brand essence\"", "word": "Brandroid", "clue": "The one who talks non-stop about the brand and wants everything aligned to company 'brand essence'. And we mean everything"}}, {"pk": 285, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "businesses that have physical (rather than online or virtual) presences", "word": "Brick-and-Mortar", "clue": "Present physically in the business world, instead of online"}}, {"pk": 286, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A period of time during which economic growth decreases rapidly.", "word": "Bust", "clue": "A time over which economic growth decreases rapidly"}}, {"pk": 287, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Bring Your Own Advil. Description for a task that's sure to give you a headache.", "word": "BYOA", "clue": "Bring Your Own Aspirin. For this project, you're going to need it..."}}, {"pk": 288, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An exchange of credits between nations designed to reduce emissions of carbon dioxide.", "word": "Carbon Trade", "clue": "An exchange between nations, designed to reduce CO2 emissions"}}, {"pk": 289, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Large companies that put less efficient and highly specialized merchants out of business.", "word": "Category Killer", "clue": "Giant companies that put others in their category, often specialist merchants, out of business"}}, {"pk": 290, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The act of Ccing an e-mail message to anyone even remotely involved in a decision or action in order to cover your own butt.", "word": "CCYA", "clue": "The act of copying the whole world and his dog into an email to cover your own butt"}}, {"pk": 291, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The ethical barrier between different divisions of a financial (or other) institution to avoid conflict of interest.", "word": "Chinese Wall", "clue": "Information barrier that keeps investors' actions secret from others in their company, to avoid conflict of interest"}}, {"pk": 292, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A term used to describe what a company does just before it goes down the tubes.", "word": "Circling the Drain", "clue": "Last ditch attempt at swimming, even when you know you're aboard a sinking ship"}}, {"pk": 293, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A traditional company that managed to successfully integrate the Internet into its existing channels.", "word": "Clicks and Mortar", "clue": "A traditional company, with physical stores, that successfully incorporates Internet into its channels"}}, {"pk": 294, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "a term for using the Internet to store applications and data so it can be accessed remotely.", "word": "Cloud", "clue": "Omnipotent, omnipresent, and omniscient, it can't be seen yet it holds everything, everywhere"}}, {"pk": 295, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A theory that seeks to explain the effect that 24-hour news networks, such as CNN, have on the general political and economic climate.", "word": "CNN Effect", "clue": "The general, political and economic effects experienced when 24 hour news networks cover a story"}}, {"pk": 296, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "When your competitor is also a partner or collaborator", "word": "Co-opetition", "clue": "When your competitor is also a partner or collaborator"}}, {"pk": 297, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A market theory that suggests that when a company reveals bad news to the public, there may be many more related negative events that have yet to be revealed.", "word": "Cockroach Theory", "clue": "The theory that behind every bit of bad news, there's much more to be revealed.  As a wise man once said, \"There's never just one\" "}}, {"pk": 298, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A Web page that opens after you unsubscribe from an e-mail list, where a final appeal is made to keep you.", "word": "Columbo Site", "clue": "The website that opens after you unsubscribe from a mailing list as a last desperate shot at persuading you to stay"}}, {"pk": 299, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The degree of dullness of a meeting, presentation or reading material", "word": "Coma Factor", "clue": "Degree of dullness. Applies to meetings, presentations, literature - potentially some colleagues..."}}, {"pk": 300, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The act of making a process, good or service easy to obtain by making it as uniform, plentiful and affordable as possible.", "word": "Commoditize", "clue": "To make a process, product or service available to everyone; by making it uniform, plentiful and cheap "}}, {"pk": 301, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Corporate obesity. When companies become too big. \"They become fat and complacent. They get lazy, lose their creativity and are no longer able to move quickly in the marketplace.\"", "word": "Corpbesity ", "clue": "When companies eat all the pies, leaving them bloated, immobile and unable to act quickly against the competition"}}, {"pk": 302, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The performance of a publicly traded company in non-financial areas such as social responsibility, sustainability and environmental performance. ", "word": "Corporate Accountability", "clue": "How a company performs in relation to making the world a nicer place to be"}}, {"pk": 303, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An act of self-infringement upon market share by corporations through the issuance of new products.", "word": "Corporate Cannibalism", "clue": "A company launching products into a market they already dominate... effectively competing against themselves"}}, {"pk": 304, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Corporate initiative to assess and take responsibility for the company's effects on the environment and impact on social welfare.", "word": "Corporate Social Responsibilty - CSR", "clue": "The measures a company takes to have a positive impact on the world"}}, {"pk": 305, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A ranking of countries according to the extent to which corruption is believed to exist. ", "word": "Corruption Perception Index - CPI", "clue": "A ranking of countries by level of corruption believed to exist"}}, {"pk": 306, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An organization's strategic plan that's displayed prominently behind an executive's desk, but sits untouched until it's updated the following year.", "word": "Credenza-Ware", "clue": "A company strategy that's prepared lovingly, displayed proudly on the walls - then never touched again. Until of course it's updated, the following year. See also 'Wallpaper'"}}, {"pk": 307, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A very important or crucial stage in a company's development, where the business activity acquires self-sustaining viability. ", "word": "Critical Mass", "clue": "A really important stage in a company's development when it finally becomes able to support itself"}}, {"pk": 308, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A project-management technique that lays out all the activities needed to complete a task, the time it will take to complete each activity and the relationships between the activities.", "word": "Critical Path Analysis", "clue": "A fancy project management term for working out where we need to get to, and how we're going to get there"}}, {"pk": 309, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Picking from each department to create the perfect team", "word": "Crossfunctional", "clue": "6 people from different disciplines in one room… often not by choice"}}, {"pk": 310, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The collective effort of individuals who network and pool their resources to support efforts initiated by other people or organizations.", "word": "Crowdfunding", "clue": "The team effort by lots of individuals to support a person or company's initiative; by pooling thoughts and resources"}}, {"pk": 311, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The most valuable unit(s) of a corporation, as defined by characteristics such as profitability, asset value and future prospects.", "word": "Crown Jewels", "clue": "The most valuable part of an organisation"}}, {"pk": 312, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A product or service that has an energetic and loyal customer base.", "word": "Cult Brand", "clue": "Most brands can but dream of reaching these lofty heights"}}, {"pk": 313, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The trail of digital information you leave behind every time you use a credit card, send an e-mail, browse the Web or use a cell phone.", "word": "Data Shadow", "clue": "It's behind you... your own personal trail of digital information, left behind each time you use a credit card, make a phone call or send an email"}}, {"pk": 314, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Anything that's not on the immediate horizon or is a low priority.", "word": "Day 2 Project ", "clue": "A project currently on the back burner"}}, {"pk": 315, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Death by Tweakage. When a product or project fails due to unnecessary tinkering or too many last-minute revisions.", "word": "DBT", "clue": "Death by Tweakage.  A project ruined by too many cooks spoiling the broth"}}, {"pk": 316, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A failure that occurs as a result of many smaller problems.", "word": "Death By A Thousand Cuts", "clue": "A failure resulting from the combination of many smaller problems."}}, {"pk": 317, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The condition of a company, whether publicly traded or private, that has gone bankrupt and ceased to exist.", "word": "Defunct", "clue": "When a company no longer exists"}}, {"pk": 318, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Device Vice", "clue": "Your inability to disconnect"}}, {"pk": 319, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "To tone down or take a step back", "word": "Dial it Back", "clue": "Hey there, why don't you just take it down a notch"}}, {"pk": 320, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The failure of a company or industry to accept that the Internet has changed the world and made their business model obsolete", "word": "Digital Denial", "clue": "Belligerent denial that the Internet has changed the world and refusal to adapt or accept change"}}, {"pk": 321, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Digital Native", "clue": "Smartphone - check! 19 social media accounts - check! Multi-platform multitasking app loving person - check!"}}, {"pk": 322, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Consultant-speak for “Trust us. We don’t have a specific answer, but if you go in this general direction we think you’ll be making the right decision.”", "word": "Directionally Correct", "clue": "Pointing people in the right direction, without giving them any actual directions. Often said in consultancy "}}, {"pk": 323, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "To remove ambiguities. To make clear. Used extensively by software developers", "word": "Disambiguate", "clue": "A not very clear word to make things clear"}}, {"pk": 324, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Disemvowelling", "clue": "That thing you do when you want to write something rude like £%@*@ in an email without alerting IT. Yup, we're onto you"}}, {"pk": 325, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A term referring to a financial seminar that presents new products or issues of securities to potential buyers. ", "word": "Dog and Pony Show", "clue": "A financial seminar that presents new products or issues of securities to potential buyers"}}, {"pk": 326, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Intense competition in a market.", "word": "Dog Eat Dog", "clue": "Survival of the fittest"}}, {"pk": 327, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A company that embraces the internet as the key component in its business. ", "word": "Dotcom", "clue": "The 1990s movement that pioneered the digital revolution"}}, {"pk": 328, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Refers to a person or group holding an unquestioned belief, argument, or philosophy without critical examination.", "word": "Drinking the Kool-Aid", "clue": "Blind obedience and absolute faith in the latest business doctrine"}}, {"pk": 329, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A provision in a contract or agreement that stipulates a finite deadline which, if not met, will automatically trigger adverse consequences.", "word": "Drop Dead Date", "clue": "A term in a contract that states a finite deadline which, if not met, will automatically trigger dire consequences"}}, {"pk": 330, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A business venture that ends up being a loss.", "word": "Dry Hole", "clue": "An unsuccessful business venture that makes a loss"}}, {"pk": 331, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A person on a company's board of directors who votes and acts on the wishes of a non-board member.", "word": "Dummy Director", "clue": "A board member who acts on the wishes of someone outside of the top team - like a total dummy"}}, {"pk": 332, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Using a product yourself which you sell to others", "word": "Eating Your Own Dogfood", "clue": "Using the product you're selling to others"}}, {"pk": 333, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A type of business model, or segment of a larger business model, that enables a firm or individual to conduct business over an electronic network, typically the internet.", "word": "E-commerce", "clue": "A type of business model, or segment of one, that lets a company do business over the internet"}}, {"pk": 334, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A brief speech that outlines an idea for a product, service or project.", "word": "Elevator Pitch", "clue": "Brief speech outlining a product, service or idea - the way you would if you had just 60 seconds. In, say, an elevator..."}}, {"pk": 335, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An organization's reputation as an employer", "word": "Employer Brand", "clue": "An organization's reputation as an employer"}}, {"pk": 336, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "The raw number of people that look at a website", "word": "Eyeballs", "clue": "People - when talking about the raw number of them that look at a website or piece of content"}}, {"pk": 337, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Investing in companies or projects that promote fair trade with producers in developing nations.", "word": "Fair Trade Investing", "clue": "Investing in companies or projects that make the world a better place to be"}}, {"pk": 338, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A word used to describe executives who earn what many believe to be unreasonably high salaries and bonuses. ", "word": "Fat Cat", "clue": "The executive with a ridiculously high salary or bonus, who generally gets more of the cream than they should "}}, {"pk": 339, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Selling goods or assets at heavily discounted prices.", "word": "Fire Sale", "clue": "Urgently selling goods at heavily discounted prices"}}, {"pk": 340, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": " A business model where the basic offer is free, but charges a premium for additional  features or services.", "word": "Freemium", "clue": "It costs nothing, really. Oh, but you can't get the good stuff without opening your wallet"}}, {"pk": 341, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A company that alters its business strategy and conceives an entirely new business plan.", "word": "Game Changer", "clue": "A company that alters its business strategy and in doing so, conceives an entirely new business plan"}}, {"pk": 342, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "content that provides a game-like experience, usually through an entertainment and reward system.", "word": "Gamification", "clue": "Turning content into a game-like experience, through entertainment and rewards"}}, {"pk": 343, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Generation Y", "clue": "That awesome millenial force of socially connected and tech savvy people"}}, {"pk": 344, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A product or service that is developed and distributed globally, but is also fashioned to accommodate the user or consumer in a local market. ", "word": "Glocalization", "clue": "Imagine a McDonald's Big Mac with the flavours of Mumbai"}}, {"pk": 345, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An irrefutable takeover offer made to a target company by an acquiring company.", "word": "Godfather Offer", "clue": "I'm gonna make him an offer he just can't refuse"}}, {"pk": 346, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A source of lots of money, such as shoppers who are expected to spend a lot or high-income earners who are expected to pay a lot in taxes.", "word": "Golden Geese", "clue": "Close cousin of the cash cow, these shoppers sure know how to spend spend spend!"}}, {"pk": 347, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A collection of financial incentives that are intended to encourage employees to remain with a company.", "word": "Golden Handcuffs", "clue": "A set of financial perks intended to retain employees"}}, {"pk": 348, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A signing bonus offered to a candidate from a rival company.", "word": "Golden Hello", "clue": "Reserved for a job candidate from a rival company, this is a special way of saying 'hi': with a huge signing bonus"}}, {"pk": 349, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An exceptional compensation package offered by the acquiring company to the top executives of the company being bought.", "word": "Golden Life Jacket", "clue": "Handier than it sounds: a financial package offered by an acquiring company, to the top team of the company they acquire"}}, {"pk": 350, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An economy that is not so hot that it causes inflation, and not so cold that it causes a recession.", "word": "Goldilocks Economy", "clue": "A well balanced economy - not hot enough to cause inflation but not cold enough to cause a recession"}}, {"pk": 351, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A term used to describe signs of economic recovery or positive data during an economic downturn.", "word": "Green Shoots", "clue": "Very good news - signs of economic recovery during an economic downturn"}}, {"pk": 352, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Greenwashing", "clue": "Your so \"eco\" & in love with the Earth that no one believes you"}}, {"pk": 353, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "People who cycle to work", "word": "Gutter Bunnies", "clue": "People who cycle to work. Wear a helmet please…"}}, {"pk": 354, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "When a company announces a lot of bad financial news ", "word": "Kitchen Sink", "clue": "When a company announces a lot of bad financial news"}}, {"pk": 355, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Easy business to close", "word": "Low-Hanging Fruit", "clue": "Easy business to close"}}, {"pk": 356, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A company's ability to retain a piece of the publics consciousness", "word": "Mindshare", "clue": "Amount of space your company takes up in the public's thoughts - like cerebral real estate"}}, {"pk": 357, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Someone who uses minimal energy to get the task accomplished.", "word": "Minergy", "clue": "The absolute bare minimum required to get the job done"}}, {"pk": 358, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Omni-Shambles", "clue": "Badly organised and ineffective in every single way"}}, {"pk": 359, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "OT Mail", "clue": "Email sent at a god forbidden hour of the night to highlight to colleagues exactly how late one is working"}}, {"pk": 360, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "an essential shift from way one of thinking to another", "word": "Paradigm Shift", "clue": "Sadly not an office disco dance move - yet. This term describes a shift from one way of thinking to another"}}, {"pk": 361, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A mixture of a smartphone and tablet.", "word": "Phablets", "clue": "What happened after a tequila fuelled night of passion between a smartphone and a tablet..."}}, {"pk": 362, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Powerpointless", "clue": "A long, detailed Powerpoint presentation with many graphs, charts and animations but no actual purpose, relevance or significance"}}, {"pk": 363, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Push Poll", "clue": "An opinion poll that's there to sway opinions, not measure them"}}, {"pk": 364, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Ringxiety", "clue": "Always thinking it's your phone that's ringing in the office. It never is"}}, {"pk": 365, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Salmon Day", "clue": "A metaphorical reference to spending the day swimming upstream only to die at the end"}}, {"pk": 366, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Scaremail", "clue": "The latest 'scare'.  Whether it's rabid dogs in surburbia or mass murderers in the supermarket"}}, {"pk": 367, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Seagull Manager", "clue": "A boss who flies in, makes a lot of noise, craps on everything, then leaves"}}, {"pk": 368, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Generating publicity through social media to increase awareness of a product, brand or event", "word": "Social media optimization (SMO) ", "clue": "Making the most of Facebook, Twitter, Pinterest, Instagram to promote a brand or product"}}, {"pk": 369, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "the sharing of information between two (or more) people", "word": "Sync-up", "clue": "The trendy way of sharing information. Circa 2013"}}, {"pk": 370, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "A senior executive selling to the senior executives of a another customer. ", "word": "Top to Top", "clue": "A senior executive selling to the senior executives of a another customer."}}, {"pk": 371, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "When a poor performing employee leaves to work for the competition", "word": "Torpedo", "clue": "When a poor performing employee leaves to work for the competition. Boom!"}}, {"pk": 372, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Twintership", "clue": "An internship offered by digitally backward companies to recent graduates.  \"Do that Twitter thing for us, yeah?\""}}, {"pk": 373, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "UGC", "clue": "When normal people create the content for you"}}, {"pk": 374, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": " Increasing a sale amount by positioning a higher value item.", "word": "Upsell", "clue": " Increasing a sale amount by positioning a higher value item"}}, {"pk": 375, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Unique Selling Point – your differentiator", "word": "USP", "clue": "That one thing that makes what you sell supposedly unique"}}, {"pk": 376, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Vanillacide", "clue": "Making hundreds of nice little changes to an idea - until it dies of mediocrity"}}, {"pk": 377, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Viral", "clue": "That supposed nirvana where an idea gets passed around exponentially with little (visible) promotion"}}, {"pk": 378, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Voicism", "clue": "The act of discriminating against a colleague based on the annoying sound of their voice"}}, {"pk": 379, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Wantrepreneur", "clue": "Self proclaimed entrepreneur, usually found on Linkedin, with little evidence of any business actually being done"}}, {"pk": 380, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "web sites that use technology beyond the static pages of earlier web sites.", "word": "Web 2.0", "clue": "Static, vintage pages from the dark age of web tech: powered by newer technology beyond them"}}, {"pk": 381, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Whiteboard Waffle", "clue": "Where the genius of your idea only works when written with dry erase markers"}}, {"pk": 382, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Wikiality", "clue": "If it is on Wikipedia it must be true"}}, {"pk": 383, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "", "word": "Workflower", "clue": "Someone who happily blends into the background at work without anyone knowing who they are or what they actually do"}}, {"pk": 384, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "Using mobile devices and wireless technology to work anywhere", "word": "Workshifting", "clue": "Using mobile devices and wireless technology to work anywhere"}}, {"pk": 385, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "One yottabyte (abbreviated \"YB\") is equal to 1,000 zettabytes and is the largest SI unit of measurement used for measuring data.", "word": "Yottabyte", "clue": "Techie speak for a WHOLE lorry load of data"}}, {"pk": 386, "model": "buzzword.Buzzword", "fields": {"genre": 5, "definition": "An employee who has few responsibilities in their personal life such as children or spouses. This allows them to work more and travel with little advance notice. ", "word": "Zero Drag", "clue": "An employee who has few responsibilities in their personal life such as children or spouses. This allows them to work more and travel with little advance notice"}}, {"pk": 387, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "3D Printing", "clue": "DIY Industrial revolution: Press CMD + P into multiple dimensions"}}, {"pk": 388, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "A web-based tool that collects and delivers syndicated content.", "word": "Aggregator", "clue": "Like a futuristic postman: an online tool that collects and delivers syndicated content"}}, {"pk": 389, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "a method of building interactive applications for the Web that process user requests immediately.", "word": "Ajax", "clue": "A method of building interactive apps that allows users to play with them immediately"}}, {"pk": 390, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "An organized index page that collects a website’s posts from the past.", "word": "Archives", "clue": "A neat index page that holds they key to a website's past - organising all of its historic posts, to browse through"}}, {"pk": 391, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "Anything that has little or no substance", "word": "Barneyware", "clue": "Anything with little or no substance"}}, {"pk": 392, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Big Data", "clue": "That amorphous idea of tons of bits of information. Could be insightful in the right hands"}}, {"pk": 393, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "Software that has more features, buttons and capability than you'll ever need. ", "word": "Bloatware", "clue": "Software that has more features, buttons and shiny things than you'll ever need"}}, {"pk": 394, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "A traditional company that managed to successfully integrate the Internet into its existing channels.", "word": "Clicks and Mortar", "clue": "A traditional company, with physical stores, that successfully incorporates Internet into its channels"}}, {"pk": 395, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "a term for using the Internet to store applications and data so it can be accessed remotely.", "word": "Cloud", "clue": "Omnipotent, omnipresent, and omniscient, it can't be seen yet it holds everything, everywhere"}}, {"pk": 396, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "Picking from each department to create the perfect team", "word": "Crossfunctional", "clue": "6 people from different disciplines in one room…often no by choice"}}, {"pk": 397, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Dark Data", "clue": "The pool of data you haven't shed light on yet"}}, {"pk": 398, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "means you’re too cheap to spend the money to buy a big enough computer system to handle all your business needs.", "word": "Data Mart ", "clue": "The tight wad who won't buy a computer system big enough to handle their business needs"}}, {"pk": 399, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "A process used by companies to turn raw data into useful information.", "word": "Data Mining", "clue": "The process that turns the rough diamond of raw data into shiny, useful information"}}, {"pk": 400, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "any anecdote or opinion disguised as fact that can be used to persuade others.", "word": "Data Point", "clue": "An opinion disguised as a cold hard fact that's used to make a point"}}, {"pk": 401, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "The trail of digital information you leave behind every time you use a credit card, send an e-mail, browse the Web or use a cell phone.", "word": "Data Shadow", "clue": "It's behind you... your own personal trail of digital information, left behind each time you use a credit card, make a phone call or send an email"}}, {"pk": 402, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "To be overwhelmed with too much information (eg. A google search that turns up six million references)", "word": "Data Smog", "clue": "Spring-cleaning redundant data out of a system"}}, {"pk": 403, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Device Vice", "clue": "Your inability to disconnect from that tech thing"}}, {"pk": 404, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "The result of being so overwhelmed by the availability, speed and volume of digital information that you can’t remember any of it (or where you might have put it on your hard drive).", "word": "Digital Amnesia", "clue": "Being so overwhelmed with fast, plentiful data that you can't remember it - or where it is on your hard drive"}}, {"pk": 405, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "The failure of a company or industry to accept that the Internet has changed the world and made their business model obsolete", "word": "Digital Denial", "clue": "Belligerent denial that the Internet has changed the world and refusal to adapt or accept change"}}, {"pk": 406, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Digital Native", "clue": "Smartphone - check! 19 social media accounts - check! Multi-platform multitasking app loving person - check!"}}, {"pk": 407, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Disemvowelling", "clue": "That thing you do when you want to write something rude like £%@*@ in an email without alerting IT. Yup, we're onto you"}}, {"pk": 408, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "A company that embraces the internet as the key component in its business. ", "word": "Dotcom", "clue": "The 1990s movement that pioneered the digital revolution"}}, {"pk": 409, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "the use of emergent social software platforms within companies, or between companies and their partners or customers", "word": "Enterprise 2.0", "clue": "The use of social media in business: both b2b, and b2c. We like it"}}, {"pk": 410, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": " A business model where the basic offer is free, but charges a premium for additional  features or services.", "word": "Freemium", "clue": "It costs nothing, really. Oh, but you can't get the good stuff without opening your wallet"}}, {"pk": 411, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Hack-a-Thon", "clue": "Get the dev team to drink tons of caffeine and invent stuff until the sun rises"}}, {"pk": 412, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "a software bug that seems to disappear or alter its behavior when one attempts to study it.", "word": "Heisenbug", "clue": "More erratic than its quantum physics namesake, this shifty software bug seems to vanish or change when you try to study it"}}, {"pk": 413, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "a cloud computing environment in which an organization provides and manages some resources in-house and has others provided externally.", "word": "Hybrid Cloud", "clue": "In-house and external resources being fused in a company's cloud computing environment"}}, {"pk": 414, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "This is a software program that lets users map data from one application to another.", "word": "Integration Connector", "clue": "Tech speak for software that lets applications share data"}}, {"pk": 415, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "This term means that multiple companies are using a single, remotely hosted database.", "word": "Multi-tenancy", "clue": "Multiple companies sharing a single, remotely hosted database"}}, {"pk": 416, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Omni-Shambles", "clue": "Badly organised and ineffective in every single way"}}, {"pk": 417, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "A mixture of a smartphone and tablet.", "word": "Phablets", "clue": "What happened after a tequila fuelled night of passion between a smartphone and a tablet..."}}, {"pk": 418, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "a paradigm for delivering operating systems and associated services over the Internet without downloads or installation", "word": "Platform as a Service (PaaS)", "clue": "When platforms and operating systems are made available online - without the need for downloads and installing"}}, {"pk": 419, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "an audio program in a compressed digital format, which is deigned to be listened to over the web.", "word": "Podcast", "clue": "Audio program, compressed digitally to be heard or downloaded over the web"}}, {"pk": 420, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Powerpointless", "clue": "A long, detailed Powerpoint presentation with many graphs, charts and animations but no actual purpose, relevance or significance"}}, {"pk": 421, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "this is a marketing term for a proprietary computing architecture that provides hosted services to a limited number of people behind a firewall.", "word": "Private Cloud", "clue": "Marketing-speak for privately-hosted services, to a set number of people behind a firewall"}}, {"pk": 422, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "A public cloud is one based on the standard cloud computing model, in which a service provider makes resources, such as applications and storage, available to the general public over the Internet", "word": "Public Cloud", "clue": "Applications, storage and other resources made available to the public through the Internet"}}, {"pk": 423, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "an acronym for Really Simple Syndication. This XML based format has become the preferred standard for syndicating content across the web.", "word": "RSS", "clue": "Rich Site Summary - later dubbed Really Simple Syndication - this style of web feed is the preferred way to send out lots of regular updates: blogs and news feeds, for example"}}, {"pk": 424, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "– Search engine optimisation ", "word": "SEO", "clue": "Helps to get you just that little bit higher up the google search"}}, {"pk": 425, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "", "word": "Small Insight Syndrome", "clue": "Where you have tons of data but no revelations"}}, {"pk": 426, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "a software distribution model in which applications are hosted by a vendor or service provider and made available to customers over a network.", "word": "Software as a Service (SaaS)", "clue": "When apps are hosted by a vendor, then made available to lots of customers over a network"}}, {"pk": 427, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "anything about a website or content that encourages a visitor to linger longer.", "word": "Stickiness", "clue": "Anything that encourages website visitors to stay a little bit longer"}}, {"pk": 428, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "web sites that use technology beyond the static pages of earlier web sites.", "word": "Web 2.0", "clue": "Static, vintage pages from the dark age of web tech: powered by newer technology beyond them"}}, {"pk": 429, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "Using mobile devices and wireless technology to work anywhere", "word": "Workshifting", "clue": "Using mobile devices and wireless technology to work anywhere"}}, {"pk": 430, "model": "buzzword.Buzzword", "fields": {"genre": 6, "definition": "One yottabyte (abbreviated \"YB\") is equal to 1,000 zettabytes and is the largest SI unit of measurement used for measuring data.", "word": "Yottabyte", "clue": "Techie speak for a WHOLE truck load of data"}}, 

{"pk": 431, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A significant amount of money.", "word": "A Ton Of Money", "clue": "A significant sum of money. Say, a ton..."}},
{"pk": 432, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "an acquisition or merger in which the companies involved have trouble integrating with one another.", "word": "Acquisition Indigestion", "clue": "Trouble two companies have with integrating, after an acquisition or merger"}},
{"pk": 433, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A physical location in a brokerage where securities are kept.", "word": "Active Box", "clue": "Physical place where stocks, bonds and other securities are kept, in a brokerage"}},
{"pk": 434, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A stock that experiences a sudden drop, usually the result of investors reacting to negative news.", "word": "Air Pocket Stock", "clue": "A stock that drops suddenly in value, like a plane in an air pocket. Without the complimentary sick bags. Often caused by investors' reactions to bad news"}},
{"pk": 435, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A stock with low market capitalization.", "word": "Ankle Biter", "clue": "A stock with low market capitalization"}},
{"pk": 436, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A postulated antithesis to fragility where high-impact events or shocks can be beneficial.", "word": "Anti-Fragility", "clue": "The theory that high-impact events or shocks can be benefical. Opposes the theory of fragility, which connects these events to financial downfall"}},
{"pk": 437, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A market theory that states stock prices and aspirin production are inversely related.", "word": "Aspirin Count Theory", "clue": "The theory that when stock prices go up, aspirin production goes down. A headache to understand..."}},
{"pk": 438, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Capital required to be set aside in order to cover a company against unexpected debt.", "word": "Asset Valuation Reserve - AVR", "clue": "Money set aside to secure a company against debts that could surprise them in future"}},
{"pk": 439, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The sale of an asset or item at a price significantly above the original purchase price due to high demand, rather than appreciation.", "word": "At A Premium", "clue": "At a sale price that's much higher than what the vendor paid originally for the item - due to high demand, not actial appreciation in value"}},
{"pk": 440, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An uneducated or unsophisticated investor.", "word": "Aunt Millie", "clue": "An uneducated or unsophisticated investor"}},
{"pk": 441, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "When the bid on a limit order is lower than the current market price or the offer price is higher than the current market price, for a particular security.", "word": "Away From The Market", "clue": "On a limit order, a bid that's significantly lower or higher than the current market price"}}, 
{"pk": 442, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The movement in spread, price or yield of a security, which makes it more expensive to issue.", "word": "Back Up", "clue": "A change in the spread, price or yield of a security - making it cost more to issue"}},
{"pk": 443, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The purchase of a large position in a stock or other financial asset by an investor or trader", "word": "Back Up The Truck", "clue": "The buying of a large position in a stock or other asset, by an investor or trader. Vrrooom!"}},
{"pk": 444, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The negative effect felt by a company when shareholders and the investment community find out that is has done something that is not in accordance with good business practices.", "word": "Badwill", "clue": "What happens when you misbehave. The negative effect felt by a company when its investment community find out about its poor business practices"}},
{"pk": 445, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An investor who holds a position in a stock which decreases in value until it is worthless.", "word": "Bag Holder", "clue": "The investor who's positioned in a stock that keeps decreasing in value - until it's worth nothing"}},
{"pk": 446, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A stock or other security that is approaching $0 in price.", "word": "Bagel Land", "clue": "A stock or other security so stale it's approaching a big, round $0 in price"}},
{"pk": 447, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "", "word": "Ballpark Figure", "clue": "You know…a guess…that fits within a metaphorical sportsground"}},
{"pk": 448, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A compilation of market and economic data that represents a general or larger trend.", "word": "Barometer", "clue": "The market and economic data that indicates trends"}}, {"pk": 449, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Financial instruments that have an impressive growth rate - but also a high risk factor", "word": "Barrybonds", "clue": "Financial instruments with a nice growth rate - and a nasty risk factor"}}, {"pk": 450, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Big Damn Number", "word": "BDN", "clue": "Big Damn Number!"}}, {"pk": 451, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Term used to describe the sense of inadequacy, shame and regret felt by an individual whenever the stock market takes a dip.", "word": "Bear Market Depressive Syndrome (BMDS)", "clue": "Sense of inadequacy, shame and regret felt when the stock market dips"}}, {"pk": 452, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A period in which prices of stocks increase during a bear market.", "word": "Bear Market Rally", "clue": "A period over which stock prices increase, in spite of the self-fulfilling negativity of a bear market"}}, {"pk": 453, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A change in market conditions that forces pessimistic investors attempting to profit from price declines to buy back an investment at a higher price than they sold it for.", "word": "Bear Squeeze", "clue": "The change in market conditions that squeezes money out of pessimistic investors; they try to profit from price declines, only to end up buying back their own assets at a higher price than at first"}}, {"pk": 454, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A fall in the price of a stock, sector, or market, or investor sentiment that assumes a fall will happen soon.", "word": "Bear Tack", "clue": "Not as cute as it sounds. A fall in the price of a stock, market or sector - or a sentiment amongst investors that a fall is soon to come"}}, {"pk": 455, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A stock that is believed to be a leading indicator of the direction of a sector, industry or market as a whole.", "word": "Bellwether Stock", "clue": "A stock that's held to be a weather forecast for the rest of its sector, industry or market - indicating its direction as a whole"}}, {"pk": 456, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An investor who sells shares at or below the bid price. ", "word": "Bid Whacker", "clue": "Investor who sells shares at, or below, bid price"}}, {"pk": 457, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A day of stock market catastrophe.", "word": "Black Friday", "clue": "A day of stock market catastrophe, in which prices crash"}}, {"pk": 458, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A company that makes a hostile takeover offer for a target company.", "word": "Black Knight", "clue": "A company making a hostile takeover offer. Not to be confused with The Dark Knight"}}, {"pk": 459, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An event or occurrence that deviates beyond what is normally expected of a situation and that would be extremely difficult to predict.", "word": "Black Swan", "clue": "An unpredictable event; flying completely in the face of what you'd usually expect from a situation. They should have called it the bright purple swan... "}}, {"pk": 460, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A limited partnership or stock offering with no stated investment goal for the funds that are raised from investors. ", "word": "Blind Pool", "clue": "Few people can see where they're going with this one; a limited partnership or stock offering with no official investment goal for the funds it raises"}}, {"pk": 461, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A term used to describe a perfect stock or investment.", "word": "Bo Derek", "clue": "A perfect stock or investment - named bizarrely after a 70's film actress"}}, {"pk": 462, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A benefit or improvement for investors.", "word": "Boon", "clue": "Benefit or improvement for investors"}}, {"pk": 463, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An investor who looks for bargains among stocks whose prices have recently dropped dramatically. ", "word": "Bottom Fisher", "clue": "A bargain hunter, looking to invest in stocks whose prices have just fallen sharply"}}, {"pk": 464, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A term used in futures markets to describe a rapid and sharp price decline.", "word": "Break", "clue": "Sharp, fast price decline - often in futures markets"}}, {"pk": 465, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A type of stock initial public offering (IPO) that trades below the original offering price to the market within the first few months after trading begins.", "word": "Break Issue", "clue": "A type of stock that, after a few months of being released to the public, starts to trade below its initial offering price"}}, {"pk": 466, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "When a security or a class of assets sees its market-driven price move in the opposite direction of the broad market or its competition.", "word": "Buck The Trend", "clue": "To have a price that moves in the opposite direction to the market, or its competition. Said of securities, or certain classes of assets"}}, {"pk": 467, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Money left over at the end of the budget year", "word": "Budget Dust", "clue": "Money left at the end of the budget year. That's one kind of dust everyone wants to clean up..."}}, {"pk": 468, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The \"use it or lose it\" spending spree that occurs near the end of the fourth quarter.", "word": "Budget Flush", "clue": "Use it or lose it' spending frenzy at the end of the fourth quarter"}}, {"pk": 469, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A period of time during which economic growth decreases rapidly.", "word": "Bust", "clue": "A time over which economic growth decreases rapidly"}}, {"pk": 470, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "CEO-speak for replacing a fellow chief executive", "word": "C-change", "clue": "Swapping one big cheese for another"}}, {"pk": 471, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A company's value based on name recognition and brand, not tangible assets. ", "word": "Capitalized Reputation", "clue": "A company's value as measured by its brand, reputation and name recognition"}}, {"pk": 472, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "When investors give up any previous gains in stock price by selling equities in an effort to get out of the market and into less risky investments.", "word": "Capitulation", "clue": "Escaping from a risky market by selling equities - causing you to lose any previous gains in stock price"}}, {"pk": 473, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The process of a company repeatedly reducing head count, but not the work, until it goes under.", "word": "Capsizing", "clue": "Repeatedly reducing head count, but not the work, until the business eventually goes under"}}, {"pk": 474, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "One of the four categories (quadrants) in the BCG growth-share matrix that represents the division within a company that has a large market share within a mature industry.", "word": "Cash Cow", "clue": "Division within a company that has a large market share in a mature industry. A share eveyone can milk for years to come..."}}, {"pk": 475, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The belief that money (cash) is more valuable than any other form of investment tool. ", "word": "Cash Is King", "clue": "The belief that money is more valuable than any other form of investment"}}, {"pk": 476, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A term for an investment strategy that is considered extremely risky.", "word": "Casino Finance", "clue": "Risky investment strategy"}}, {"pk": 477, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A slang term referring to speculative stocks that have short or suspicious histories for sales, earnings, dividends etc", "word": "Cats and Dogs", "clue": "Speculative stocks with short, suspicious histories. May bite, if provoked"}}, {"pk": 478, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A champagne stock is one that has made shareholders a great deal of money.", "word": "Champagne Stock", "clue": "A stock that's made its investors enough money for a fountain of cuvée de prestige"}}, {"pk": 479, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "To artificially increase revenue figures by selling to dealers and distributors who do not have ultimate buyers. ", "word": "Channel Stuffing", "clue": "Need to bump up this quarter's figures?  Do this and deal with the consequences later…"}}, {"pk": 480, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "What a company's management does when it decides to trim small, trivial costs instead of cutting larger, more serious costs. ", "word": "Chasing Nickels Around Dollar Bills", "clue": "Cutting small, trivial costs; instead of bigger, serious ones"}}, {"pk": 481, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The act of investors choosing investments that have performed well within another portfolio in anticipation that the trend will continue. ", "word": "Cherry Picking", "clue": "Choosing investments that have performed well in other sectors - in the hope that they'll do the same in yours. Tasty"}}, {"pk": 482, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A traditional company that managed to successfully integrate the Internet into its existing channels.", "word": "Clicks and Mortar", "clue": "A traditional company, with physical stores, that successfully incorporates Internet into its channels"}}, {"pk": 483, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A debt investment that is said to have no principal, no interest and no maturity value. ", "word": "Clinton Bond", "clue": "A debt investment named after the onetime President that is said to have no principal, no interest and no maturity value..."}}, {"pk": 484, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An investment strategy in which investors mimic the trades of well-known and historically successful investors.", "word": "Coattail Investing", "clue": "Copycat investment strategy, mimicing the actions of successful investors"}}, {"pk": 485, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A market that is believed to have the potential to make a strong move in one direction after being pushed in the opposite direction.", "word": "Coiled Market", "clue": "A market that is believed to have the potential to make a strong move in one direction after being pushed in the opposite direction"}}, {"pk": 486, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Equity shares owned by major shareholders of a publicly traded corporation.", "word": "Control Stock", "clue": "Equity shares owned by major sharedholders of a publicly traded corporation"}}, {"pk": 487, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An accounting practice in which a company uses generous reserves from good years against losses that might be incurred in bad years. ", "word": "Cookie Jar Accounting", "clue": "Not as tasty as it sounds, this accounting practice sees companies using generous reserves from better days against losses incurred in bad years"}}, {"pk": 488, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A term used to describe someone considered to have bad luck with stock picking.", "word": "Cooler", "clue": "Someone who really shouldn't be selected to do the stock picking"}}, {"pk": 489, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Corporate obesity. When companies become too big. \"They become fat and complacent. They get lazy, lose their creativity and are no longer able to move quickly in the marketplace.\"", "word": "Corpbesity ", "clue": "When companies eat all the pies, leaving them bloated, immobile and unable to act quickly against the competition"}}, {"pk": 490, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A situation in which a creditor is forced to accept undesirable terms imposed by a court during a bankruptcy or reorganization. ", "word": "Cram-Down Deal", "clue": "A situation in which a creditor is forced to accept undesirable terms in the face of bankruptcy"}}, {"pk": 491, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A sudden and significant decline in the value of a market.", "word": "Crash", "clue": "A dramatic decline in the value of a market"}}, {"pk": 492, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A crisis that occurs when several financial institutions issue or are sold high-risk loans that start to default.", "word": "Credit Crisis", "clue": "A financial crisis that occurs when institutions are sold high-risk loans that default"}}, {"pk": 493, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An economic condition in which investment capital is difficult to obtain. ", "word": "Credit Crunch", "clue": "The economic climate in which consumers panic and begin buying supermarket own labels 'coz it's the credit crunch, innit'"}}, {"pk": 494, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A project-management technique that lays out all the activities needed to complete a task, the time it will take to complete each activity and the relationships between the activities.", "word": "Critical Path Analysis", "clue": "A fancy project management term for working out where we need to get to, and how we're going to get there"}}, {"pk": 495, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The collective effort of individuals who network and pool their resources to support efforts initiated by other people or organizations.", "word": "Crowdfunding", "clue": "The team effort by lots of individuals to support a person or company's initiative; by pooling thoughts and resources"}}, {"pk": 496, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The most valuable unit(s) of a corporation, as defined by characteristics such as profitability, asset value and future prospects.", "word": "Crown Jewels", "clue": "The most valuable part of an organisation"}}, {"pk": 497, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A classification describing stocks that have a sizable investor following, despite the fact that the underlying company has somewhat insignificant fundamentals.", "word": "Cult Stock", "clue": "Stocks with a sizeable investor following in spite of the underlying company being somewhat insignificant"}}, {"pk": 498, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Trading that occurs outside of general market regulations. ", "word": "Curb Trading", "clue": "Trading with little regard for the rules"}}, {"pk": 499, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The \"real time\" price of a security trading on an exchange, as well as the most recent price of a security listed in an investment portfolio.", "word": "Current Price", "clue": "The 'real time' price of stock"}}, {"pk": 500, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A term used to describe when a board of directors declares an additional dividend in addition to the regular distribution.", "word": "Cutting A Melon", "clue": "When a board of directors declares an additional dividend in addition to the regular distribution"}}, {"pk": 501, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "means you’re too cheap to spend the money to buy a big enough computer system to handle all your business needs.", "word": "Data Mart ", "clue": "The tight wad who won't buy a computer system big enough to handle their business needs"}}, {"pk": 502, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A temporary improvement from a major drop in a stock's price", "word": "Dead Cat Bounce", "clue": "A temporary improvement from a major drop in a stock's price"}}, {"pk": 503, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A stipulation on a defense mechanism (or poison pill) used by companies in order to protect against a merger or takeover by another company.", "word": "Dead Hand Provision", "clue": "A poison pill used by companies to protect against a merger or takeover by another company"}}, {"pk": 504, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "When the market is flat and not moving in either direction. Investors are indecisive - like deer frozen in the headlights.", "word": "Deer Market", "clue": "A market that's frozen in the headlights, not moving in either direction, and potentially about to get flattened"}}, {"pk": 505, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The condition of a company, whether publicly traded or private, that has gone bankrupt and ceased to exist.", "word": "Defunct", "clue": "When a company no longer exists"}}, {"pk": 506, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "When property, stocks or other assets are sold in an urgent manner, often at a loss.", "word": "Distressed Sale", "clue": "A rapid, urgent sale of assets, often at a loss"}}, {"pk": 507, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A dishonest broker tactic that involves convincing a client to purchase a stock because it's about to pay a dividend. ", "word": "Dividend Selling", "clue": "Convincing a client to purchase stock because it's about to pay a dividend"}}, {"pk": 508, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The process of adding investments to one's portfolio in such a way that the risk/return trade-off is worsened.", "word": "Diworsification", "clue": "Adding investments to a portfolio in such a way that the risk/ return trade-off is worsened"}}, {"pk": 509, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Intense competition in a market.", "word": "Dog Eat Dog", "clue": "Survival of the fittest"}}, {"pk": 510, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An investing strategy that consists of buying the 10 DJIA stocks with the highest dividend yield at the beginning of the year.", "word": "Dogs Of The Dow", "clue": "An investment strategy involving buying the 10 DJIA stocks with the highest dividend yield at the beginning of the year"}}, {"pk": 511, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The negative movement in the price of a security, sector or market. ", "word": "Downside", "clue": "The negative movement in the price of a security, sector or market"}}, {"pk": 512, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The process of investing on an ongoing basis in a small but growing firm over a period of time.", "word": "Drip Feed", "clue": "Investing on an ongoing basis in a small but growing firm over a period of time"}}, {"pk": 513, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A provision in a contract or agreement that stipulates a finite deadline which, if not met, will automatically trigger adverse consequences.", "word": "Drop Dead Date", "clue": "A term in a contract that states a finite deadline which, if not met, will automatically trigger dire consequences"}}, {"pk": 514, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A business venture that ends up being a loss.", "word": "Dry Hole", "clue": "An unsuccessful business venture that makes a loss"}}, {"pk": 515, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A term referring to marketable securities that are highly liquid and considered cash-like.", "word": "Dry Powder", "clue": "Marketable securities that are highly liquid and considered as cash"}}, {"pk": 516, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An entity that holds shares in a public company on behalf of an individual or firm, the latter being the real or true owner of these shares. ", "word": "Dummy Shareholder", "clue": "Someone who holds shares in a public company on behalf of an individual who is the true owner of the shares"}}, {"pk": 517, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Large institutions that have the funds to make high volumes trades. ", "word": "Elephants", "clue": "Large institutions with enough funds to make high volume trades"}}, {"pk": 518, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A revolving credit arrangement in which the borrower periodically renews the debt financing rather than having the debt reach maturity.", "word": "Evergreen Funding", "clue": "A revolving credit arrangement in which a borrower renews debt financing periodically rather than allowing the debt to reach maturity"}}, {"pk": 519, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Investing in companies or projects that promote fair trade with producers in developing nations.", "word": "Fair Trade Investing", "clue": "Investing in companies or projects that make the world a better place to be"}}, {"pk": 520, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A company whose stock once had a very price but has since come down significantly. ", "word": "Fallen Angel", "clue": "A company whose stock once had a very price but has since come down significantly"}}, {"pk": 521, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A phrase for a security or industry in which the current price or value has dropped significantly in a short period of time.", "word": "Falling Knife", "clue": "When the current value of an industry drops significantly in a short period of time"}}, {"pk": 522, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An additional letter added onto four-letter ticker symbols to signify to market participants that there is additional information about a specific company's stock.", "word": "Fifth-Letter Identifier", "clue": "An extra letter added onto a company's four letter ticker symbol to signify that there's additional information available"}}, {"pk": 523, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "Selling goods or assets at heavily discounted prices.", "word": "Fire Sale", "clue": "Urgently selling goods at heavily discounted prices"}}, {"pk": 524, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The action of investors moving their capital away from riskier investments to the safest possible investment vehicles.", "word": "Flight to Quality", "clue": "Investors moving risky investments to the safest investment vehicles as security"}}, {"pk": 525, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A term indicating the last-minute infusion of cash into a company about to go bankrupt.", "word": "Foam the Runway", "clue": "A last minute cash-injection into a company about to go bust"}}, {"pk": 526, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A pattern of economic growth where periods of rapid expansion are followed by periods of slow growth.", "word": "Fox-Trot Economy", "clue": "A difficult to follow pattern of growth in which rapid expansion is followed by slow growth"}}, {"pk": 527, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The unethical practice of a broker trading an equity based on information from the analyst department before his or her clients have been given the information.", "word": "Front Running", "clue": "The practice of a broker trading equity based on information provided by analysts before his clients have given permission"}}, {"pk": 528, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An investor who attends the annual shareholders meeting to criticize the corporation's executives.", "word": "Gadfly", "clue": "An investor who attends shareholder meetings to point out faults with the corporation's executives"}}, {"pk": 529, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A high-growth company that is increasing its revenues by at least 20% annually for four years or more, starting from a revenue base of at least $1 million.", "word": "Gazelle Company", "clue": "A high-growth company"}}, {"pk": 530, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "The practice of raising the price of a previously agreed-upon real estate transaction.", "word": "Gazump", "clue": "A cheeky practice originating from dodgy car salesmen who raised the price after a transaction had already been agreed"}}, {"pk": 531, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An illegal practice whereby two or more market makers collectively attempt to influence and change the price of a stock.", "word": "Ghosting", "clue": "A strictly illegal practice where two market makers join forces to influence and change the price of stock"}}, {"pk": 532, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An irrefutable takeover offer made to a target company by an acquiring company.", "word": "Godfather Offer", "clue": "I'm gonna make him an offer he just can't refuse"}}, {"pk": 533, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A collection of financial incentives that are intended to encourage employees to remain with a company.", "word": "Golden Handcuffs", "clue": "A set of financial perks intended to retain employees"}}, {"pk": 534, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A signing bonus offered to a candidate from a rival company.", "word": "Golden Hello", "clue": "Reserved for a job candidate from a rival company, this is a special way of saying 'hi': with a huge signing bonus"}}, {"pk": 535, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An exceptional compensation package offered by the acquiring company to the top executives of the company being bought.", "word": "Golden Life Jacket", "clue": "Handier than it sounds: a financial package offered by an acquiring company, to the top team of the company they acquire"}}, {"pk": 536, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A type of share that gives its shareholder veto power over changes to the company's charter.", "word": "Golden Share", "clue": "A type of share with special privileges - shareholders veto power over changes to the company's charter"}}, {"pk": 537, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "An economy that is not so hot that it causes inflation, and not so cold that it causes a recession.", "word": "Goldilocks Economy", "clue": "A well balanced economy - not hot enough to cause inflation but not cold enough to cause a recession"}}, {"pk": 538, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "A term used to describe signs of economic recovery or positive data during an economic downturn.", "word": "Green Shoots", "clue": "Very good news - signs of economic recovery during an economic downturn"}}, {"pk": 539, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "", "word": "Hockey Stick", "clue": "The mythical revenue chart that shows your idea going like a rocket…just not now"}}, {"pk": 540, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "When a company announces a lot of bad financial news ", "word": "Kitchen Sink", "clue": "When a company announces a lot of bad financial news"}}, {"pk": 541, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "To increase the price of the stock by using underhand methods", "word": "Paint the Tape", "clue": "To increase the price of the stock by using underhand methods"}}, {"pk": 542, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "If your forcast done in your spreadsheet  does not match with the forecast done in your CRM system.", "word": "Sheetzophrenic", "clue": "If your forcast done in your spreadsheet  does not match with the forecast done in your CRM system. Oops"}}, {"pk": 543, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "When a stockholder can not sell a stock", "word": "Stuckholder", "clue": "When a stockholder can not sell a stock"}}, 

{"pk": 544, "model": "buzzword.Buzzword", "fields": {"genre": 7, "definition": "manipulating the financial statements. It is done by resorting to various gimmicks to inflate revenue and profits and show less liabilities and more assets.", "word": "Voodoo Accounting ", "clue": "A little bit naughty. Manipulating the financial statements..."}}]